mbarbeau0545/STM32_FMKCAN/Src/FMK_FDCAN.c
/**
 * @file        FMK_MAC.c
 * @brief       Framework Memory Access Control module.
 * @note        TemplateDetailsDescription.\n
 *
 * @author      mba
 * @date        15/09/2024
 * @version     1.0
 */






// ********************************************************************
// *                      Includes
// ********************************************************************
#include "./FMK_FDCAN.h"
#ifdef APPSYS_MODULE_FMKCAN_ENABLE

#include "FMK_HAL/FMK_CPU/Src/FMK_CPU.h"
#include "FMK_CFG/FMKCFG_ConfigFiles/FMKFDCAN_ConfigPrivate.h"
#include "FMK_HAL/FMK_IO/Src/FMK_IO.h"
#include "APP_CTRL/APP_SYS/Src/APP_SYS.h"
#include "APP_CTRL/APP_SDM/Src/APP_SDM.h"

#include "Library/QUEUE/Src/LIBQueue.h"
#include "Library/SafeMem/SafeMem.h"
#include "stm32g4xx_hal.h"

// ********************************************************************
// *                      Defines
// ********************************************************************

// ********************************************************************
// *                      Types
// ********************************************************************
/* CAUTION : Automatic generated code section for Enum: Start */

/* CAUTION : Automatic generated code section for Enum: End */


/**
 * @brief Enumeration for the list of FDCAN BSP callback events.
 */
typedef enum __t_eFMKFDCAN_BspCallbackList
{
    FMKFDCAN_BSP_TX_CB_EVENT = 0x00,       /**< General Tx callback event. */
    FMKFDCAN_BSP_TX_CB_BUFFER_COMPLETE,    /**< Tx buffer transmission completed. */
    FMKFDCAN_BSP_TX_CB_BUFFER_ABORT,       /**< Tx buffer transmission aborted. */
    FMKFDCAN_BSP_TX_CB_FIFO_EMPTY,         /**< Tx FIFO is empty. */

    FMKFDCAN_BSP_RX_CB_FIFO_0,             /**< Rx FIFO 0 event. */
    FMKFDCAN_BSP_RX_CB_FIFO_1,             /**< Rx FIFO 1 event. */

    FMKFDCAN_BSP_CB_PROTOCOL_ERR,          /**< Protocol error detected. */

    FMKFDCAN_BSP_CB_NB                     /**< Total number of callbacks (for bounds checking). */
} t_eFMKFDCAN_BspCallbackList;

/**
 * @brief Bsp Callback Status
 */
typedef enum __t_eFMKFDCAN_BspStatusCb
{
    FMKFDCAN_CALLBACK_STATUS_ACTIVATE = 0x00,       /**< The Callback needs activated by software */
    FMKFDCAN_CALLBACK_STATUS_DEACTIVATE,            /**< The Callback needs deactivated by software */

    FMKFDCAN_CALLBACK_STATUS_NB,
} t_eFMKFDCAN_BspStatusCb;
//-----------------------------ENUM TYPES-----------------------------//

/* CAUTION : Automatic generated code section for Structure: Start */

/* CAUTION : Automatic generated code section for Structure: End */
//-----------------------------STRUCT TYPES---------------------------//
/**
 * @brief Soft flags structure to manage various FDCAN software flags.
 */
typedef struct __t_sFMKFDCAN_FlagSoft
{
    t_bool TxQueuePending_b;       /**< Indicates if there are pending frames in the Tx queue. */
    t_bool RxQueuePending_b;       /**< Indicates if there are pending frames in the Rx queue. */
    t_bool TxFramePrioPending_b;   /**< Indicates if a prioritized Tx frame is pending. */
    t_bool ErrorDetected_b;        /**< Indicates if an error has been detected. */
    t_bool readOpe_b;              /**< Indicates if the read operation is on going */         
} t_sFMKFDCAN_FlagSoft;

/**
 * @brief User register structure for managing FDCAN items and callbacks.
 */
typedef struct
{
    t_sFMKFDCAN_ItemIdentifier itemId_s; /**< Identifier structure for the FDCAN item. */
    t_uint32 maskId_u32;                 /**< Mask identifier for the FDCAN item. */
    t_cbFMKFDCAN_RcvItem *rcvItem_cb;    /**< Callback function to handle received items. */
} t_sFMKFDCAN_UserItemSub;

///@brief Strucutre for diagnostic purpose 
typedef struct 
{
    t_uint32 rxMsgReceived_u32;      /**< Number of msg actually received  */
    t_uint32 rxMsgProcess_u32;      /**< Number of msg process */
    t_uint32 rxMsgDropped_u32;      /**< Number of message lost */
    t_uint32 rxOverflow_u32;        /**< Number of rx Fifo overflow */
    t_uint32 txMsgSend_u32;         /**< Number of Tx Msg send */
} t_sFMKFDCAN_TxMsgDiag;
/**
 * @brief Node information structure for FDCAN configuration and status.
 */
typedef struct __t_sFMKFDCAN_NodeInfo
{
    FDCAN_HandleTypeDef bspNode_s;                          /**< BSP handle for FDCAN peripheral. */
    t_sLIBQUEUE_QueueCore TxSoftQueue_s;                    /**< Transmission Queue management*/
    t_sLIBQUEUE_QueueCore RxSoftQueue_s;                    /**< Transmission Queue management*/
    t_sFMKFDCAN_UserItemSub * userSubInfo_pas;              /**< Pointor to user register information */
    t_sFMKFDCAN_TxMsgDiag msgDiag_s;
    t_uint8 nbSubscriptions_u8;                             /**< Number of subscription done for the node */
    t_eFMKCPU_ClockPort c_Clock_e;                          /**< Clock port associated with the FDCAN node. */
    t_eFMKCPU_IRQNType c_IrqnLine1_e;                       /**< IRQ line 1 associated with the FDCAN peripheral. */
    t_eFMKCPU_IRQNType c_IrqnLine2_e;                       /**< IRQ line 2 associated with the FDCAN peripheral. */
    t_sFMKFDCAN_FlagSoft Flag_s;                            /**< Software flags related to the FDCAN node. */
    t_bool isNodeConfigured_b;                              /**< Indicates if the FDCAN node has been configured. */
    t_bool isNodeActive_b;                                  /**< Indicates if the FDCAN node is active and operational. */
    t_eFMKFDCAN_NodeStatus nodeHealth_e;                    /**< Node status */
    t_uint32 lastErrorCb_u32;                               /**< To know when the last time bsp call us with error */
} t_sFMKFDCAN_NodeInfo;



/* CAUTION : Automatic generated code section : Start */

/* CAUTION : Automatic generated code section : End */
//-----------------------------TYPEDEF TYPES---------------------------//

// ********************************************************************
// *                      Prototypes
// ********************************************************************
	
