mbarbeau0545/STM32_FMKCAN/Src/FMK_FDCAN.c
// ********************************************************************
// *                      Variables
// ********************************************************************
static t_eCyclicModState g_FmkCan_ModState_e = STATE_CYCLIC_CFG;
/* Store information about node*/
t_sFMKFDCAN_NodeInfo g_NodeInfo_as[FMKFDCAN_NODE_NB];

/**< User Item Registration Managment */
t_sFMKFDCAN_UserItemSub g_UserRegisterEvnt_as[FMKFDCAN_NODE_NB][FMKFDCAN_RX_NUM_REGISTRATION_EVNT];

/**< Hardware Interrupt Management */
t_eFMKFDCAN_BspStatusCb g_BspCbMngmt_ae[FMKFDCAN_NODE_NB][FMKFDCAN_BSP_CB_NB];
//********************************************************************************
//                      Local functions - Prototypes
//*********************************************************************************
/**
 *	@brief      Init the CAN driver used thanks to c_FmkCan_IsNodeActive
 *
 */
static t_eReturnCode s_FMKFDCAN_ConfigurationState(void);
/**
 *	@brief      Activate Interrupt line 
 *
 */
static t_eReturnCode s_FMKFDCAN_PreOperational(void);
/**
 *	@brief      Perform Cyclic Operation
 *
 */
static t_eReturnCode s_FMKFDCAN_Operational(void);
/**
*	@brief      Configure The Initiation of the Hardware
*	@note       Set the pin, Set the bsp Init Strucuture, 
*               Set the hardware clock, set the Interruption Enabling
*               Call FDCAN_Init and configure Fifo Mode.\n
*
 *	@param[in]  f_Node_e     : The Node where the RxMsg is Pending -> enum value from @ref t_eFMKFDCAN_NodeList
 *	@param[in]  f_NodeCfg_s  : software init structure @ref t_sFMKFDCAN_DrvNodeCfg
 *	 
 *  @retval RC_OK                             @ref RC_OK
 *  @retval RC_ERROR_PARAM_INVALID            @ref RC_ERROR_PARAM_INVALID
 *  @retval RC_ERROR_PTR_NULL                 @ref RC_ERROR_PTR_NULL
 *  @retval RC_ERROR_NOT_SUPPORTED            @ref RC_ERROR_NOT_SUPPORTED
*
*/
static t_eReturnCode s_FMKFDCAN_InitDriver(t_eFMKFDCAN_NodeList f_Node_e, t_sFMKFDCAN_DrvNodeCfg f_NodeCfg_s);

/**
 *	@brief      Set the initiation of the Node.\n
 *	@note       We extract from software confgiuration the bsp configuration
 *              and copy it into bsp init structure. Then we call HAL_FDCAN.\n
 *
 *	@param[in]  f_bspInit_ps : bsp init structrue @ref FDCAN_HandleTypeDef
 *	@param[in]  f_NodeCfg_s  : software init structure @ref t_sFMKFDCAN_DrvNodeCfg
 *	 
 *  @retval RC_OK                             @ref RC_OK
 *  @retval RC_ERROR_PARAM_INVALID            @ref RC_ERROR_PARAM_INVALID
 *  @retval RC_ERROR_PTR_NULL                 @ref RC_ERROR_PTR_NULL
 *  @retval RC_ERROR_NOT_SUPPORTED            @ref RC_ERROR_NOT_SUPPORTED
 *
 */
static t_eReturnCode s_FMKFDCAN_SetBspNodeInit(FDCAN_HandleTypeDef *f_bspInit_ps, t_sFMKFDCAN_DrvNodeCfg f_NodeCfg_s);
/**
 *	@brief      Function called when Bsp Tx Interruption occured.\n
 *	@note       In this function, We firstly see if the flag TxItemPending is raised.\n
 *              If it's the case, that means there is messages waiting to be sent in the 
 *              software buffer, we send FMKFDCAN_MAX_TX_ITEM_SEND_PER_IT messages per Interruption
 *              or at least the amount of TxItem in the Queue.\n
 *              If the Queu Size equals 0, reset the flag and Reset The Interruption for this function
 *              because it's no longer required as there isn't message to send.\n
 *
 *	@param[in] f_bspInfo_ps : a pointor to bsp Node, @ref FDCAN_HandleTypeDef
 *	@param[in] f_EvntCbInfo_u32 : information and the bsp interruption
 *	@param[in] f_bspRxCallback_e : information about the callback that raise the interruption
 *	 
 *  @retval RC_OK                             @ref RC_OK
 *  @retval RC_ERROR_PARAM_INVALID            @ref RC_ERROR_PARAM_INVALID
 *  @retval RC_ERROR_PTR_NULL                 @ref RC_ERROR_PTR_NULL
 *  @retval RC_ERROR_NOT_SUPPORTED            @ref RC_ERROR_NOT_SUPPORTED
 *
 */
static void s_FMKFDCAN_BspTxEventCb(FDCAN_HandleTypeDef *f_bspInfo_ps, 
                                              t_uint32 f_EvntCbInfo_u32, 
                                              t_eFMKFDCAN_BspCallbackList f_bspTxCallback_e);
/**
 *	@brief      Function called When Bsp Rx Interruption occured.\n
 *	@note       In this function, We firstly trying to know which node and which Bsp Rx Fifo
 *              Causes the intetrruption with f_bspInfo_ps and f_EvntCbInfo_u32.\n
 *              Then if f_EvntCbInfo_u32 says that a message has been received we treat wether 
 *              we call user if the Identifier is register with the callback or we store it into the dedicate 
 *              Software Buffer.\n 
 *              If the flag is Fifo Full we rapidly put FMKFDCAN_MAX_ITEM_ON_QUEUE_PER_IT messages into a Software Buffer 
 *              and raise flag so that message will be treated in cyclic.\n
 *              
 *	@param[in] f_bspInfo_ps : a pointor to bsp Node, @ref FDCAN_HandleTypeDef
 *	@param[in] f_EvntCbInfo_u32 : information and the bsp interruption
 *	@param[in] f_bspRxCallback_e : information about the callback that raise the interruption
 *	 
 *  @retval RC_OK                             @ref RC_OK
 *  @retval RC_ERROR_PARAM_INVALID            @ref RC_ERROR_PARAM_INVALID
 *  @retval RC_ERROR_PTR_NULL                 @ref RC_ERROR_PTR_NULL
 *  @retval RC_ERROR_NOT_SUPPORTED            @ref RC_ERROR_NOT_SUPPORTED
 *
 */
static void s_FMKFDCAN_BspRxEventCb(FDCAN_HandleTypeDef *f_bspInfo_ps, 
                                              t_uint32 f_EvntCbInfo_u32, 
                                              t_eFMKFDCAN_BspCallbackList f_bspRxCallback_e);
/**
 *	@brief      Receive Error From Bsp, Save them, and raise a flag 'Error Pending'
 *
 *	@param[in] f_bspInfo_ps : a pointor to bsp Node, @ref FDCAN_HandleTypeDef
 *	@param[in] f_EvntCbInfo_u32 : information and the bsp interruption
 *
 *
 */
static void s_FMKFDCAN_BspErrorEventCb(FDCAN_HandleTypeDef *f_bspInfo_ps, 
                                              t_uint32 f_EvntCbInfo_u32);
/**
 *	@brief      Get a RX Message strcuture from bsp fifo
 *
 *	@param[in] f_Node_e        : The Node where the RxMsg is Pending -> enum value from @ref t_eFMKFDCAN_NodeList
 *	@param[in] f_RxFifo_e      : The Fifo where the RxMsg is Pending
 *	@param[in] f_bspRxItem_ps  : A pointor To receive RxMsg
 *	@param[in] f_bspData_pu8   : A pointor to data
 *
 *  @retval RC_OK                             @ref RC_OK
 *  @retval RC_ERROR_PARAM_INVALID            @ref RC_ERROR_PARAM_INVALID
 *  @retval RC_ERROR_PTR_NULL                 @ref RC_ERROR_PTR_NULL
 *  @retval RC_ERROR_NOT_SUPPORTED            @ref RC_ERROR_NOT_SUPPORTED
 *  @retval RC_ERROR_WRONG_RESULT             @ref RC_ERROR_WRONG_RESULT
 *
 */
static t_eReturnCode s_FMKFDCAN_RetrieveRxItem(t_eFMKFDCAN_NodeList f_Node_e,
                                                  t_uint32 f_BspRxFifo_u32,
                                                  FDCAN_RxHeaderTypeDef * f_bspRxItem_ps,
                                                  t_uint8 * f_bspData_pu8);
/**
 *	@brief      Copy a Software TxItem into a Bsp TxItem.\n
 *
 *	@param[in] f_bspTxItem_ps   : a pointer to bsp RxITem to copy Data Strucutre -> @ref FDCAN_TxHeaderTypeDef
 *	@param[in] f_TxItemCfg_s    : a pointer to software TxITem  -> @ref t_sFMKFDCAN_TxItem
 *
 *  @retval RC_OK                             @ref RC_OK
 *  @retval RC_ERROR_PARAM_INVALID            @ref RC_ERROR_PARAM_INVALID
 *  @retval RC_ERROR_PTR_NULL                 @ref RC_ERROR_PTR_NULL
 *  @retval RC_ERROR_NOT_SUPPORTED            @ref RC_ERROR_NOT_SUPPORTED
 */
static t_eReturnCode s_FMKFDCAN_CopyBspTxItem(t_sFMKFDCAN_TxItem *f_TxItemCfg_s, FDCAN_TxHeaderTypeDef *f_bspTxItem_ps);
/**
 *	@brief      Copy a Software RxItem into a Bsp RxItem.\n
 *
 *	@param[in] f_bspRxItem_ps : a pointer to bsp TxITem to copy Data Strucutre -> @ref FDCAN_RxHeaderTypeDef
 *	@param[in] f_RxItem_ps    : a pointer to oftware TxITem  -> @ref t_sFMKFDCAN_RxItemEvent
 *	@param[in] f_bspData_pu8  : a pointor ta data
 *	 
 *
 *  @retval RC_OK                             @ref RC_OK
 *  @retval RC_ERROR_PARAM_INVALID            @ref RC_ERROR_PARAM_INVALID
 *  @retval RC_ERROR_PTR_NULL                 @ref RC_ERROR_PTR_NULL
 *  @retval RC_ERROR_NOT_SUPPORTED            @ref RC_ERROR_NOT_SUPPORTED
 */
static t_eReturnCode s_FMKFDCAN_CopyBspRxItem(FDCAN_RxHeaderTypeDef *f_bspRxItem_ps,
                                              t_sFMKFDCAN_RxItemEvent * f_RxItem_ps,
                                              t_uint8 * f_bspData_pu8);
/**
 *	@brief      Get the user Register Index from Software Fifo Buffer.\n
 *	@note       This function purpose is to find the RxItem store into software buffer
 *              using f_Identifier_u32 and f_nodeSubs_pas.\n
 *              At the Registration we copy Identifier and Mask into Software Buffer Registration.\n
 *              In order to return f_idxUserRegister_pu8, We compare every Buffer_item & mask with
 *              f_Identifier_u32 and the mask.\n
 *              If the Identifier is not found in Software Buffer f_idxUserRegister_pu8 = 0
 *
 *	@param[in] f_Identifier_u32 : The identifier to find into Registration
 *	@param[in] f_nodeSubs_pas : Registration Software Buffer -> @ref t_sFMKFDCAN_UserItemSub
 *	@param[in] f_RegistrationCtr_u8 : Number of registration which as been made in f_nodeSubs_pas
 *	@param[in] f_idxUserRegister_pu8 : Storage for Idx Register.\n
 *	 
 *  @retval RC_OK                             @ref RC_OK
 *  @retval RC_ERROR_PTR_NULL                 @ref RC_ERROR_PTR_NULL
 *  @retval RC_ERROR_LIMIT_REACHED            @ref RC_ERROR_LIMIT_REACHED
 *
 */
static t_eReturnCode s_FMKFDCAN_UserCallbackMngmt(  t_eFMKFDCAN_NodeList f_Node_e,
                                                    t_sFMKFDCAN_RxItemEvent * f_RxItemEvnt_ps);

/**
 *	@brief      Configure the Global Filter for All Node And FIFO
 *  @note       At this point, all Id are acdepted there are not filters.
 *              To not let the filter floating we set them to accept every id
 *
 *
 *	@param[in] f_Node_e : CAN  Node -> enum value from @ref t_eFMKFDCAN_NodeList
 *	@param[in] f_bspCb_e : bsp calback -> enum value from @ref t_eFMKFDCAN_BspCallbackList
 *	@param[in] f_status_e : status bsp calback -> enum value from @ref t_eFMKFDCAN_BspStatusCb
 *	 
 *  @retval RC_OK                             @ref RC_OK
 *  @retval RC_ERROR_PARAM_INVALID            @ref RC_ERROR_PARAM_INVALID
 *  @retval RC_ERROR_WRONG_RESULT             @ref RC_ERROR_WRONG_RESULT
 */
static t_eReturnCode s_FMKFDCAN_SetNodeFilters(void);
/**
 *	@brief      Set the Hardware Bsp Callback Status -> Active or Inactive.\n
 *	@note       The Hal_FDCAN Library allows us to dynamically set the callback status 
 *              of interrutpion.\n
 *              This function update the status using f_status_e of a callback f_bspCb_e
 *              of a dedicate Node.\n 
 *
 *
 *	@param[in] f_Node_e : CAN  Node -> enum value from @ref t_eFMKFDCAN_NodeList
 *	@param[in] f_bspCb_e : bsp calback -> enum value from @ref t_eFMKFDCAN_BspCallbackList
 *	@param[in] f_status_e : status bsp calback -> enum value from @ref t_eFMKFDCAN_BspStatusCb
 *	 
 *  @retval RC_OK                             @ref RC_OK
 *  @retval RC_ERROR_PARAM_INVALID            @ref RC_ERROR_PARAM_INVALID
 *  @retval RC_ERROR_WRONG_RESULT             @ref RC_ERROR_WRONG_RESULT
 */
static t_eReturnCode s_FMKFDCAN_SetHwBspCallbackStatus(t_eFMKFDCAN_NodeList f_Node_e ,
                                                        t_eFMKFDCAN_BspCallbackList f_bspCb_e,
                                                        t_eFMKFDCAN_BspStatusCb f_status_e);
/**
 *	@brief      Set the Node FIFO Operation Mode for Hardware Rx Fifo.\n
 *	@note       Each Node has x Rx FIFO, which can configured as Overwrite or Blocking.\n
 *              When the fifo is full and a message is receive, in the first case, 
 *              the hardware erase an element and write the new one. In the other case,
 *              new message is not receive
 *              Here we decided to applied f_fifoMode_e at every Fifos Node.\n
 *              
 *	@param[in] f_Node_e : CAN  Node -> enum value from @ref t_eFMKFDCAN_NodeList
 *	@param[in] f_fifoMode_e : Operation Fifo Mode, enum value from @ref t_eFMKFDCAN_FifoOpeMode
 *	 
 *  @retval RC_OK                             @ref RC_OK
 *  @retval RC_ERROR_PARAM_INVALID            @ref RC_ERROR_PARAM_INVALID
 *  @retval RC_ERROR_WRONG_RESULT             @ref RC_ERROR_WRONG_RESULT
 */
static t_eReturnCode s_FMKFDCAN_SetHwFifoOpeMode(t_eFMKFDCAN_NodeList f_Node_e ,t_eFMKFDCAN_FifoOpeMode f_fifoMode_e);
/**
 *	@brief      Module FDCAN Fast Task, call every 5 ms.\n
 *	@note       This function deal with Rx Software Fifo, take several elements
 *              from the Fifo, interpret it and call user with registration mapping
 *              If there is some Tx Fifo item, we will try to put it into Hardware Fifo.\n
 * @example     Send 30 Msg of 64 bytes and receive it (60) and treat in less than 50 ms
 *              
 *	 
 */
static void s_FMKFDCAN_FastTask(void);
/**
 *	@brief      Module FDCAN Fast Task, call every 5 ms.\n
 *	@note       This function deal with Rx Software Fifo, take several elements
 *              from the Fifo, interpret it and call user with registration mapping
 *              If there is some Tx Fifo item, we will try to put it into Hardware Fifo.\n
 *              
 *	 
 */
static t_eReturnCode s_FMKFDCAN_FastTask_TxFifoMngmt(t_eFMKFDCAN_NodeList f_node_e);
/**
 *	@brief      Module FDCAN Fast Task, call every 5 ms.\n
 *	@note       This function deal with Rx Software Fifo, take several elements
 *              from the Fifo, interpret it and call user with registration mapping
 *              If there is some Tx Fifo item, we will try to put it into Hardware Fifo.\n
 *              
 *	 
 */
static t_eReturnCode s_FMKFDCAN_FastTask_RxFifoMngmt(t_eFMKFDCAN_NodeList f_node_e);
/**
 *	@brief          Get the Bsp Callback Identifier from Software enum.\n
 *
 *	@param[in]      f_Callback_e : enum value for the callback, value from @ref t_eFMKFDCAN_BspCallbackList.\n
 *	@param[out]     f_bspCallback_u32 : Storage for Bsp Callback Identifier.\n
 *	 
 *  @retval RC_OK                             @ref RC_OK
 *  @retval RC_ERROR_PARAM_INVALID            @ref RC_ERROR_PARAM_INVALID
 *  @retval RC_ERROR_PTR_NULL                 @ref RC_ERROR_PTR_NULL
 *  @retval RC_ERROR_NOT_SUPPORTED            @ref RC_ERROR_NOT_SUPPORTED
 *
 */
static t_eReturnCode s_FMKFDCAN_GetBspCallbackId(t_eFMKFDCAN_BspCallbackList f_Callback_e, t_uint32 *f_bspCallback_u32);
/**
 *	@brief          Get the Bsp FIFO Identifier from Software enum.\n
 *
 *	@param[in]      f_FiRxfoId_e : enum value for FIFO, value from @ref t_eFMKFDCAN_HwRxFifoList.\n
 *	@param[out]     f_bspRxFifoId_u32 : Storage for Bsp FIFO Identifier.\n
 *	 
 *  @retval RC_OK                             @ref RC_OK
 *  @retval RC_ERROR_PARAM_INVALID            @ref RC_ERROR_PARAM_INVALID
 *  @retval RC_ERROR_PTR_NULL                 @ref RC_ERROR_PTR_NULL
 *  @retval RC_ERROR_NOT_SUPPORTED            @ref RC_ERROR_NOT_SUPPORTED
 *
 */
static t_eReturnCode s_FMKFDCAN_GetBspRxFifoId(t_eFMKFDCAN_HwRxFifoList f_FiRxfoId_e, t_uint32 *f_bspRxFifoId_u32);
/**
 *	@brief          Get the Bsp Buffer Identifier from Software enum.\n
 *
 *	@param[in]      f_TxFifoId_e : enum value for FIFO, value from @ref t_eFMKFDCAN_HwRxFifoList.\n
 *	@param[out]     f_bspTxFifoId_u32 : Storage for Bsp FIFO Identifier.\n
 *	 
 *  @retval RC_OK                             @ref RC_OK
 *  @retval RC_ERROR_PARAM_INVALID            @ref RC_ERROR_PARAM_INVALID
 *  @retval RC_ERROR_PTR_NULL                 @ref RC_ERROR_PTR_NULL
 *  @retval RC_ERROR_NOT_SUPPORTED            @ref RC_ERROR_NOT_SUPPORTED
 *
 */
static t_eReturnCode s_FMKFDCAN_GetBspTxFifoId(t_eFMKFDCAN_HwTxFifoList f_TxFifoId_e, t_uint32 *f_bspTxFifoId_u32);
/**
 *	@brief          Get the Bsp Frame Purpose from Software enum.\n
 *
 *	@param[in]      f_frameType_e : enum value for frame purpose, value from @ref t_eFMKFDCAN_FramePurpose.\n
 *	@param[out]     f_bspFramePurpose_pu32 : Storage for Bsp Frame Purpose.\n
 *	 
 *  @retval RC_OK                             @ref RC_OK
 *  @retval RC_ERROR_PARAM_INVALID            @ref RC_ERROR_PARAM_INVALID
 *  @retval RC_ERROR_PTR_NULL                 @ref RC_ERROR_PTR_NULL
 *  @retval RC_ERROR_NOT_SUPPORTED            @ref RC_ERROR_NOT_SUPPORTED
 *
 */
static t_eReturnCode s_FMKFDCAN_GetBspFramePurpose(t_eFMKFDCAN_FramePurpose f_frameType_e, t_uint32 *f_bspFramePurpose_pu32);
/**
 *	@brief          Get the Bsp Queue Type from Software enum.\n
 *
 *	@param[in]      f_queueType_e : enum value for queue type, value from @ref t_eFMKFDCAN_HwTxQueueType.\n
 *	@param[out]     f_bspQueueType_pu32 : Storage for Bsp Queue Type.\n
 *	 
 *  @retval RC_OK                             @ref RC_OK
 *  @retval RC_ERROR_PARAM_INVALID            @ref RC_ERROR_PARAM_INVALID
 *  @retval RC_ERROR_PTR_NULL                 @ref RC_ERROR_PTR_NULL
 *  @retval RC_ERROR_NOT_SUPPORTED            @ref RC_ERROR_NOT_SUPPORTED
 *
 */
static t_eReturnCode s_FMKFDCAN_GetBspQueueType(t_eFMKFDCAN_HwTxQueueType f_queueType_e, t_uint32 *f_bspQueueType_pu32);
/**
 *	@brief          Get the Bsp FIFO Operation Mode from Software enum.\n
 *
 *	@param[in]      f_fifoOpeMode : enum value for FIFO operation mode, value from @ref t_eFMKFDCAN_FifoOpeMode.\n
 *	@param[out]     f_bspfifoOpeMode_e : Storage for Bsp FIFO Operation Mode.\n
 *	 
 *  @retval RC_OK                             @ref RC_OK
 *  @retval RC_ERROR_PARAM_INVALID            @ref RC_ERROR_PARAM_INVALID
 *  @retval RC_ERROR_PTR_NULL                 @ref RC_ERROR_PTR_NULL
 *  @retval RC_ERROR_NOT_SUPPORTED            @ref RC_ERROR_NOT_SUPPORTED
 *
 */
static t_eReturnCode s_FMKFDCAN_GetBspFifoOpeMode(t_eFMKFDCAN_FifoOpeMode f_fifoOpeMode , t_uint32 *f_bspfifoOpeMode_e);
/**
 *	@brief          Get the Bsp Identifier Type from Software enum.\n
 *
 *	@param[in]      f_IdType : enum value for identifier type, value from @ref t_eFMKFDCAN_IdentifierType.\n
 *	@param[out]     f_bspIdType_pu32 : Storage for Bsp Identifier Type.\n
 *	 
 *  @retval RC_OK                             @ref RC_OK
 *  @retval RC_ERROR_PARAM_INVALID            @ref RC_ERROR_PARAM_INVALID
 *  @retval RC_ERROR_PTR_NULL                 @ref RC_ERROR_PTR_NULL
 *  @retval RC_ERROR_NOT_SUPPORTED            @ref RC_ERROR_NOT_SUPPORTED
 *
 */
static t_eReturnCode s_FMKFDCAN_GetBspIdType(t_eFMKFDCAN_IdentifierType f_IdType, t_uint32 *f_bspIdType_pu32);
/**
 *	@brief          Get the Bsp Bit Rate Status from Software enum.\n
 *
 *	@param[in]      f_BitRate_e : enum value for bit rate status, value from @ref t_eFMKFDCAN_BitRateSwitchStatus.\n
 *	@param[out]     f_BspBitRate_pu32 : Storage for Bsp Bit Rate Status.\n
 *	 
 *  @retval RC_OK                             @ref RC_OK
 *  @retval RC_ERROR_PARAM_INVALID            @ref RC_ERROR_PARAM_INVALID
 *  @retval RC_ERROR_PTR_NULL                 @ref RC_ERROR_PTR_NULL
 *  @retval RC_ERROR_NOT_SUPPORTED            @ref RC_ERROR_NOT_SUPPORTED
 *
 */
static t_eReturnCode s_FMKFDCAN_GetBspBitRateStatus(t_eFMKFDCAN_BitRateSwitchStatus f_BitRate_e, t_uint32 *f_BspBitRate_pu32);
/**
 *	@brief          Get the Bsp Data Length Code (DLC) from Software enum.\n
 *
 *	@param[in]      f_Dlc_e : enum value for data length code, value from @ref t_eFMKFDCAN_DataLength.\n
 *	@param[out]     f_BspDlc_pu32 : Storage for Bsp Data Length Code.\n
 *	 
 *  @retval RC_OK                             @ref RC_OK
 *  @retval RC_ERROR_PARAM_INVALID            @ref RC_ERROR_PARAM_INVALID
 *  @retval RC_ERROR_PTR_NULL                 @ref RC_ERROR_PTR_NULL
 *  @retval RC_ERROR_NOT_SUPPORTED            @ref RC_ERROR_NOT_SUPPORTED
 *
 */
static t_eReturnCode s_FMKFDCAN_GetBspDlc(t_eFMKFDCAN_DataLength f_Dlc_e, t_uint32 *f_BspDlc_pu32);
/**
 *	@brief          Get the Software Data Length Code (DLC) from Bsp value.\n
 *
 *	@param[in]      f_BspDlc_u32 : Bsp Data Length Code.\n
 *	@param[out]     f_Dlc_pe : Storage for Software Data Length Code, value from @ref t_eFMKFDCAN_DataLength.\n
 *	 
 *  @retval RC_OK                             @ref RC_OK
 *  @retval RC_ERROR_PARAM_INVALID            @ref RC_ERROR_PARAM_INVALID
 *  @retval RC_ERROR_PTR_NULL                 @ref RC_ERROR_PTR_NULL
 *  @retval RC_ERROR_NOT_SUPPORTED            @ref RC_ERROR_NOT_SUPPORTED
 *
 */
static t_eReturnCode s_FMKFDCAN_GetDlcFromBsp(t_uint32 f_BspDlc_u32, t_eFMKFDCAN_DataLength *f_Dlc_pe);
/**
 *	@brief          Get the Bsp Frame Format from Software enum.\n
 *
 *	@param[in]      f_formatType_e : enum value for frame format, value from @ref t_eFMKFDCAN_FrameFormat.\n
 *	@param[out]     f_BspFormatType_pu32 : Storage for Bsp Frame Format.\n
 *	 
 *  @retval RC_OK                             @ref RC_OK
 *  @retval RC_ERROR_PARAM_INVALID            @ref RC_ERROR_PARAM_INVALID
 *  @retval RC_ERROR_PTR_NULL                 @ref RC_ERROR_PTR_NULL
 *  @retval RC_ERROR_NOT_SUPPORTED            @ref RC_ERROR_NOT_SUPPORTED
 *
 */
static t_eReturnCode s_FMKFDCAN_GetBspFDFormat(t_eFMKFDCAN_FrameFormat f_formatType_e, t_uint32 *f_BspFormatType_pu32);
/**
 *	@brief          Get the Bsp Clock Kernel Divider from Software enum.\n
 *
 *	@param[in]      f_ClkDiv_e : enum value for clock kernel divider, value from @ref t_eFMKFDCAN_ClockKernelDiv.\n
 *	@param[out]     bspClkDiv_pu32 : Storage for Bsp Clock Kernel Divider.\n
 *	 
 *  @retval RC_OK                             @ref RC_OK
 *  @retval RC_ERROR_PARAM_INVALID            @ref RC_ERROR_PARAM_INVALID
 *  @retval RC_ERROR_PTR_NULL                 @ref RC_ERROR_PTR_NULL
 *  @retval RC_ERROR_NOT_SUPPORTED            @ref RC_ERROR_NOT_SUPPORTED
 *
 */
static t_eReturnCode s_FMKFDCAN_GetClockKernelDivider(t_eFMKFDCAN_ClockKernelDiv f_ClkDiv_e, t_uint32 * bspClkDiv_pu32);
//********************************************************************************
//                      Public functions - Implementation
//********************************************************************************
/*******************
* FMKFDCAN_Init
******************/
t_eReturnCode FMKFDCAN_Init(void)
{
    t_eReturnCode Ret_e = RC_OK;
    t_uint8 idxBspCallback_u8;
    t_uint8 idxNode_u8 = (t_uint8)0;
    t_uint8 LLI_u8 = (t_uint8)0;

