mbarbeau0545/STM32_FMKCAN/Src/FMK_FDCAN.c
    t_sLIBQUEUE_QueueCfg TxBufferCfg_s;
    t_sLIBQUEUE_QueueCfg RxBufferCfg_s;
    //-----------------For Every Node in FDCAN----------------//
    for (idxNode_u8 = (t_uint8)0 ; (idxNode_u8 < FMKFDCAN_NODE_NB) && (Ret_e == RC_OK) ; idxNode_u8++)
    {   
        // init bufferHead_p
        RxBufferCfg_s.bufferHead_pv = (void *)NULL;
        // init Node Global Inforamtion
        g_NodeInfo_as[idxNode_u8].Flag_s.ErrorDetected_b        = (t_bool)False;
        g_NodeInfo_as[idxNode_u8].Flag_s.readOpe_b              = (t_bool)False;
        g_NodeInfo_as[idxNode_u8].Flag_s.RxQueuePending_b       = (t_bool)False;
        g_NodeInfo_as[idxNode_u8].Flag_s.TxQueuePending_b       = (t_bool)False;
        g_NodeInfo_as[idxNode_u8].Flag_s.TxFramePrioPending_b   = (t_bool)False;
        g_NodeInfo_as[idxNode_u8].isNodeActive_b                = (t_bool)False;
        g_NodeInfo_as[idxNode_u8].isNodeConfigured_b            = (t_bool)False;
        g_NodeInfo_as[idxNode_u8].nodeHealth_e                  = FMKFDCAN_NODE_STATE_OK;
        g_NodeInfo_as[idxNode_u8].c_Clock_e                     = c_FmkFdcan_NodeCfg_as[idxNode_u8].c_Clock_e;
        g_NodeInfo_as[idxNode_u8].c_IrqnLine1_e                 = c_FmkFdcan_NodeCfg_as[idxNode_u8].c_IrqnLine1_e;
        g_NodeInfo_as[idxNode_u8].c_IrqnLine2_e                 = c_FmkFdcan_NodeCfg_as[idxNode_u8].c_IrqnLine2_e;
        g_NodeInfo_as[idxNode_u8].bspNode_s.Instance            = c_FmkFdcan_NodeCfg_as[idxNode_u8].Instance;
        g_NodeInfo_as[idxNode_u8].userSubInfo_pas               = (t_sFMKFDCAN_UserItemSub *)(&g_UserRegisterEvnt_as[idxNode_u8][0]);
        g_NodeInfo_as[idxNode_u8].nbSubscriptions_u8            = (t_uint8)0;
        g_NodeInfo_as[idxNode_u8].msgDiag_s.rxMsgDropped_u32  = (t_uint32)0;
        g_NodeInfo_as[idxNode_u8].msgDiag_s.rxMsgProcess_u32  = (t_uint32)0;
        g_NodeInfo_as[idxNode_u8].msgDiag_s.rxMsgReceived_u32 = (t_uint32)0;
        g_NodeInfo_as[idxNode_u8].msgDiag_s.rxOverflow_u32    = (t_uint32)0;
        g_NodeInfo_as[idxNode_u8].msgDiag_s.txMsgSend_u32     = (t_uint32)0;

        //-------------------Init Bsp Callback To Deactivate----------------//
        for(idxBspCallback_u8 = (t_uint8)0 ; idxBspCallback_u8 < FMKFDCAN_BSP_CB_NB ; idxBspCallback_u8++)
        {
            g_BspCbMngmt_ae[idxNode_u8][idxBspCallback_u8] = FMKFDCAN_CALLBACK_STATUS_DEACTIVATE;
        }

        //-------------------Initialize RxItem Registration ----------------//
        for(LLI_u8 = (t_uint8)0 ; LLI_u8 < (t_uint8)FMKFDCAN_RX_NUM_REGISTRATION_EVNT ; LLI_u8++)
        {
            g_UserRegisterEvnt_as[idxNode_u8][LLI_u8].itemId_s.Identifier_u32 = (t_uint32)0;
            g_UserRegisterEvnt_as[idxNode_u8][LLI_u8].itemId_s.FramePurpose_e = FMKFDCAN_FRAME_PURPOSE_NB;
            g_UserRegisterEvnt_as[idxNode_u8][LLI_u8].itemId_s.IdType_e = FMKFDCAN_IDTYPE_NB;
            g_UserRegisterEvnt_as[idxNode_u8][LLI_u8].maskId_u32 = (t_uint32)0;
            g_UserRegisterEvnt_as[idxNode_u8][LLI_u8].rcvItem_cb = (t_cbFMKFDCAN_RcvItem *)NULL_FUNCTION;
        }
        //-------------------Configure the Rx, Tx Queue----------------//
        // Configure Rx Buffer Queue
        RxBufferCfg_s.bufferHead_pv = c_FmkFdcan_NodeCfg_as[idxNode_u8].rxBufferStartAddress_pas;
        RxBufferCfg_s.bufferSize_u8 = c_FmkFdcan_NodeCfg_as[idxNode_u8].rxBufferSize_u16,
        RxBufferCfg_s.elementSize_u8 = sizeof(t_sFMKFDCAN_RxItemBuffer),
        RxBufferCfg_s.enableOverwrite_b = False,

        Ret_e = LIBQUEUE_Create(&g_NodeInfo_as[idxNode_u8].RxSoftQueue_s, RxBufferCfg_s);

        if((Ret_e == RC_ERROR_PARAM_INVALID)
        && (RxBufferCfg_s.bufferSize_u8 == (t_uint8)0))
        {
            //---- normal 'cause node is not beeing used ----//
            Ret_e = RC_OK;
        }

        // Configure Tx Buffer Queue
        if(Ret_e == RC_OK)
        {
            TxBufferCfg_s.bufferHead_pv = c_FmkFdcan_NodeCfg_as[idxNode_u8].txBufferStartAddress_pas;
            TxBufferCfg_s.bufferSize_u8 = c_FmkFdcan_NodeCfg_as[idxNode_u8].txBufferSize_u16,
            TxBufferCfg_s.elementSize_u8 = sizeof(t_sFMKFDCAN_TxItemBuffer),
            TxBufferCfg_s.enableOverwrite_b = False,

            Ret_e = LIBQUEUE_Create(&g_NodeInfo_as[idxNode_u8].TxSoftQueue_s, TxBufferCfg_s);
            if((Ret_e == RC_ERROR_PARAM_INVALID)
            && (TxBufferCfg_s.bufferSize_u8 == (t_uint8)0))
            {
                //---- normal 'cause node is not beeing used ----//
                Ret_e = RC_OK;
            }
        }
    }
    
    return Ret_e;
}

/***********************
* FMKFDCAN_Cyclic
************************/
t_eReturnCode FMKFDCAN_Cyclic(void)
{
    t_eReturnCode Ret_e = RC_OK;

    switch (g_FmkCan_ModState_e)
    {
        case STATE_CYCLIC_CFG:
        {
            Ret_e = s_FMKFDCAN_ConfigurationState();;
            if(Ret_e == RC_OK)
            {
                g_FmkCan_ModState_e = STATE_CYCLIC_WAITING;
            }
            break;
        }
        case STATE_CYCLIC_PREOPE:
        {
            Ret_e = s_FMKFDCAN_PreOperational();
            if(Ret_e  == RC_OK)
            {
                g_FmkCan_ModState_e = STATE_CYCLIC_OPE;
            }
            break;
        }
        case STATE_CYCLIC_WAITING:
        {
            // nothing to do just wait AppSys Signal
            break;
        }
        case STATE_CYCLIC_OPE:
        {
            Ret_e = s_FMKFDCAN_Operational();
            if(Ret_e < RC_OK)
            {
                g_FmkCan_ModState_e = STATE_CYCLIC_ERROR;
            }
            break;
        }
        
        case STATE_CYCLIC_ERROR:
        {
            break;
        }
        case STATE_CYCLIC_BUSY:
        default:
            Ret_e = RC_OK;
            break;
    }
    return Ret_e;
}

/*********************************
 * FMKCDA_GetState
 *********************************/
t_eReturnCode FMKFDCAN_GetState(t_eCyclicModState *f_State_pe)
{
    t_eReturnCode Ret_e = RC_OK;
    
    if(f_State_pe == (t_eCyclicModState *)NULL)
    {
        Ret_e = RC_ERROR_PTR_NULL;
    }
    if(Ret_e == RC_OK)
    {
        *f_State_pe = g_FmkCan_ModState_e;
    }

    return Ret_e;
}

