mbarbeau0545/STM32_FMKCAN/Src/FMK_FDCAN.c
/*********************************
 * FMKCDA_SetState
 *********************************/
t_eReturnCode FMKFDCAN_SetState(t_eCyclicModState f_State_e)
{

    g_FmkCan_ModState_e = f_State_e;
    return RC_OK;
}

/*********************************
* FMKFDCAN_ConfigureRxItemEvent
*********************************/
t_eReturnCode FMKFDCAN_ConfigureRxItemEvent(t_eFMKFDCAN_NodeList f_Node_e, t_sFMKFDCAN_RxItemEventCfg f_RxItemCfg_s)
{
    t_eReturnCode Ret_e;
    t_uint8 idxCounter_u8 = (t_uint8)0;
    t_sFMKFDCAN_NodeInfo * nodeInfo_ps;

    if((f_Node_e >= FMKFDCAN_NODE_NB)
    || (f_RxItemCfg_s.callback_cb == (t_cbFMKFDCAN_RcvItem *)NULL_FUNCTION))
    {
        Ret_e = RC_ERROR_PARAM_INVALID;
    }
    else 
    {   
        nodeInfo_ps = (t_sFMKFDCAN_NodeInfo *)(&g_NodeInfo_as[f_Node_e]);
        if(nodeInfo_ps->isNodeConfigured_b == (t_bool)False)
        {
            Ret_e = RC_ERROR_INSTANCE_NOT_INITIALIZED;
        }
        if(nodeInfo_ps->nbSubscriptions_u8 >= FMKFDCAN_RX_NUM_REGISTRATION_EVNT)
        {
            Ret_e = RC_ERROR_LIMIT_REACHED;
        }
        else
        {
            Ret_e = RC_OK;            
            //-------------------Copy Information into Register Node Variable-------------------//
            idxCounter_u8 = nodeInfo_ps->nbSubscriptions_u8;
            nodeInfo_ps->userSubInfo_pas[idxCounter_u8].itemId_s.Identifier_u32 = f_RxItemCfg_s.ItemId_s.Identifier_u32;
            nodeInfo_ps->userSubInfo_pas[idxCounter_u8].itemId_s.FramePurpose_e = f_RxItemCfg_s.ItemId_s.FramePurpose_e;
            nodeInfo_ps->userSubInfo_pas[idxCounter_u8].itemId_s.IdType_e = f_RxItemCfg_s.ItemId_s.IdType_e;
            nodeInfo_ps->userSubInfo_pas[idxCounter_u8].maskId_u32 = f_RxItemCfg_s.maskId_u32;
            nodeInfo_ps->userSubInfo_pas[idxCounter_u8].rcvItem_cb = f_RxItemCfg_s.callback_cb;

            //-------------------update countor Register-------------------//
            nodeInfo_ps->nbSubscriptions_u8 += (t_uint8)1;
        }
    }
    return Ret_e;
}

/*********************************
* FMKFDCAN_SendTxItem
*********************************/
t_eReturnCode FMKFDCAN_SendTxItem(t_eFMKFDCAN_NodeList f_Node_e, t_sFMKFDCAN_TxItem f_TxItemCfg_s)
{
    t_eReturnCode Ret_e;
    HAL_StatusTypeDef bspRet_e = HAL_OK;
    t_sFMKFDCAN_TxItemBuffer SoTxitem_s;
    t_sFMKFDCAN_NodeInfo * nodeInfo_ps;
    t_uint32 fifoLevel_u32 = 0;


    if(f_Node_e >= FMKFDCAN_NODE_NB)
    {
        Ret_e = RC_ERROR_PARAM_INVALID;
    }
    if(g_FmkCan_ModState_e != STATE_CYCLIC_OPE)
    {
        Ret_e = RC_WARNING_BUSY;
    }
    else
    {
        nodeInfo_ps = (t_sFMKFDCAN_NodeInfo * )(&g_NodeInfo_as[f_Node_e]);
        //------------------- Copy Bsp TxItem in BspTxItem-------------------//
        Ret_e = s_FMKFDCAN_CopyBspTxItem(&f_TxItemCfg_s, &SoTxitem_s.bspTxItem_s);
        if(Ret_e == RC_OK)
        {
            fifoLevel_u32 = HAL_FDCAN_GetTxFifoFreeLevel(&nodeInfo_ps->bspNode_s);

            // if the hardware buffer is not full, add directly the message 
            // else put it in the software buffer only if there <= DLC_8 Bytes
            // and activate IT notification to send msg from HAL Callback
            if(fifoLevel_u32 > (t_uint32)0)
            {
                bspRet_e = HAL_FDCAN_AddMessageToTxFifoQ(&nodeInfo_ps->bspNode_s,
                                                        &SoTxitem_s.bspTxItem_s,
                                                        f_TxItemCfg_s.CanMsg_s.data_pu8);
                if(bspRet_e != HAL_OK)
                {
                    Ret_e = RC_WARNING_WRONG_RESULT;
                }
                else 
                {
                    nodeInfo_ps->msgDiag_s.txMsgSend_u32++;
                }
            }
            //-----if hardware fifo Tx full, put in in software fifo if dlc <= 8-----//
            else
            {
                //----------copy structure into SoTxitem_s----------//
                //-----Copy data Into Software Buffer Structre,
                //      if size fifo element is enough-----//
                if(f_TxItemCfg_s.CanMsg_s.Dlc_e > FMKFDCAN_TX_BUFFER_DATA_SIZE)
                {
                    Ret_e = RC_WARNING_LIMIT_REACHED;
                }
                else 
                {
                    Ret_e = SafeMem_memcpy( SoTxitem_s.data_ua8, 
                                            f_TxItemCfg_s.CanMsg_s.data_pu8,
                                            (t_uint16)f_TxItemCfg_s.CanMsg_s.Dlc_e);
                    if(Ret_e == RC_OK)
                    {
                        //----------Write Into Software Queue----------//
                        Ret_e = LIBQUEUE_WriteElement(  &nodeInfo_ps->TxSoftQueue_s, 
                                                        &SoTxitem_s, 
                                                        sizeof(t_sFMKFDCAN_TxItemBuffer));
                    }
                    //----------update flag Tx Item to send/----------//
                    if(Ret_e == RC_OK)
                    {
                        nodeInfo_ps->Flag_s.TxQueuePending_b = True;
                    }
                }
            }
        }
        
    }
    return Ret_e;
}

/***********************
* FMKFDCAN_PRIVATE_GetHandleTypeDef
************************/
FDCAN_HandleTypeDef * FMKFDCAN_PRIVATE_GetHandleTypeDef(t_eFMKFDCAN_NodeList f_Node_e)
{
    if(g_NodeInfo_as[f_Node_e].isNodeConfigured_b == (t_bool)False)
    {
        ASSERT((t_uint16)0);
    }
    return (FDCAN_HandleTypeDef *)(&g_NodeInfo_as[f_Node_e].bspNode_s);
}
//********************************************************************************
//                      Local functions - Implementation
//********************************************************************************
/***********************
* s_FMKFDCAN_InitDriver
************************/
static t_eReturnCode s_FMKFDCAN_InitDriver(t_eFMKFDCAN_NodeList f_Node_e, t_sFMKFDCAN_DrvNodeCfg f_NodeCfg_s)
{
    t_eReturnCode Ret_e = RC_OK;
    HAL_StatusTypeDef bspRet_e = HAL_OK;

    if(f_Node_e >= FMKFDCAN_NODE_NB)
    {
        Ret_e = RC_ERROR_PARAM_INVALID;
    }
    if(Ret_e == RC_OK)
    {
        //----------Configure Pin Init----------//
        if(Ret_e == RC_OK)
        {
            Ret_e = FMKIO_Set_ComCanCfg((t_eFMKIO_ComSigCan)f_Node_e);
        }
        //----------Copy Bsp Init from Config/----------//
        if(Ret_e == RC_OK)
        {
            Ret_e = s_FMKFDCAN_SetBspNodeInit(&g_NodeInfo_as[f_Node_e].bspNode_s, f_NodeCfg_s);
        }
        //----------Set hardware clock RCC----------//
        if(Ret_e == RC_OK)
        {
            Ret_e = FMKCPU_Set_HwClock(g_NodeInfo_as[f_Node_e].c_Clock_e, FMKCPU_CLOCKPORT_OPE_ENABLE);
        }
        //----------set enable the Interruption----------//
        if(Ret_e == RC_OK)
        {
            Ret_e = FMKCPU_Set_NVICState(g_NodeInfo_as[f_Node_e].c_IrqnLine1_e, FMKCPU_NVIC_OPE_ENABLE);
            if(Ret_e == RC_OK)
            {
                Ret_e = FMKCPU_Set_NVICState(g_NodeInfo_as[f_Node_e].c_IrqnLine2_e, FMKCPU_NVIC_OPE_ENABLE);
            }
        }
        //----------Call Bsp Init for FDCAN----------//
        if(Ret_e == RC_OK)
        {
            bspRet_e = HAL_FDCAN_Init(&g_NodeInfo_as[f_Node_e].bspNode_s);
        }
        //----------Set Hardware FIFO mode for FDCAN----------//
        if(bspRet_e == HAL_OK)
        {
            Ret_e = s_FMKFDCAN_SetHwFifoOpeMode(f_Node_e, f_NodeCfg_s.FifoMode_e);
        }
    }
    if(bspRet_e != HAL_OK)
    {
        Ret_e = RC_ERROR_WRONG_RESULT;
    }
    else 
    {
        g_NodeInfo_as[f_Node_e].isNodeConfigured_b = (t_bool)True;
    }
    
    return Ret_e;
}

