mbarbeau0545/STM32_FMKCAN/Src/FMK_FDCAN.c
/*********************************
* s_FMKFDCAN_ConfigurationState
*********************************/
static t_eReturnCode s_FMKFDCAN_ConfigurationState(void)
{
    t_eReturnCode Ret_e = RC_OK;
    t_uint8 idxNode_u8 = (t_uint8)0;
    t_sFMKFDCAN_DrvNodeCfg nodeCfg_s;
    t_uint8 idxBspNodeCfg_u8;
    for (idxNode_u8 = (t_uint8)0 ; (idxNode_u8 < FMKFDCAN_NODE_NB) && (Ret_e == RC_OK) ; idxNode_u8++)
    { 
        //-----------------Init driver if Node is used ----------------//
        if(c_FmkCan_IsNodeActive[idxNode_u8] == (t_bool)True)
        {
            idxBspNodeCfg_u8 = c_FmkCan_NodeCfg_ae[idxNode_u8];

            //-----------------Copy FdCan Configuration ----------------//
            nodeCfg_s.clockDivider_e = c_FmkCan_BspNodeCfgList_as[idxBspNodeCfg_u8].clockDivider_e;
            nodeCfg_s.DataBaudrate_e = c_FmkCan_BspNodeCfgList_as[idxBspNodeCfg_u8].DataBaudrate_e;
            nodeCfg_s.FifoMode_e = c_FmkCan_BspNodeCfgList_as[idxBspNodeCfg_u8].FifoMode_e;
            nodeCfg_s.FrameBaudrate_e = c_FmkCan_BspNodeCfgList_as[idxBspNodeCfg_u8].FrameBaudrate_e;
            nodeCfg_s.ProtocolUse_e = c_FmkCan_BspNodeCfgList_as[idxBspNodeCfg_u8].ProtocolUse_e;
            nodeCfg_s.QueueType_e = c_FmkCan_BspNodeCfgList_as[idxBspNodeCfg_u8].QueueType_e;
            
            //-----------------Call Init Driver Managment----------------//
            Ret_e = s_FMKFDCAN_InitDriver((t_eFMKFDCAN_NodeList)idxNode_u8, nodeCfg_s);
            
            //---- add fast task callback ----//
            if(Ret_e == RC_OK)
            {
                Ret_e = APPSYS_AddFastTask( APPSYS_MODULE_FMK_CAN, 
                                            s_FMKFDCAN_FastTask);
            }
        }
    }

    return Ret_e;
}
/*********************************
* s_FMKFDCAN_PreOperational
*********************************/
static t_eReturnCode s_FMKFDCAN_PreOperational(void)
{
    t_eReturnCode Ret_e = RC_OK;
    HAL_StatusTypeDef bspRet_e = HAL_OK;
    t_uint8 idxNode_u8;
    //----------Activate Notification that are always ON----------//
    for(idxNode_u8 = (t_uint8)0; idxNode_u8 < FMKFDCAN_NODE_NB ; idxNode_u8++)
    {
        if(g_NodeInfo_as[idxNode_u8].isNodeConfigured_b == (t_bool)True)
        {
                  
            //---------- CallBack for every FIFO_0 Event----------//
            Ret_e = s_FMKFDCAN_SetHwBspCallbackStatus(idxNode_u8,
                                                    FMKFDCAN_BSP_RX_CB_FIFO_0,
                                                    FMKFDCAN_CALLBACK_STATUS_ACTIVATE);
            if(Ret_e == RC_OK)
            {
                //---------- CallBack for every FIFO_1 Event----------//
                Ret_e = s_FMKFDCAN_SetHwBspCallbackStatus(idxNode_u8,
                                                        FMKFDCAN_BSP_RX_CB_FIFO_1,
                                                        FMKFDCAN_CALLBACK_STATUS_ACTIVATE);

            }
            if(Ret_e == RC_OK)
            {
                //---------- CallBack for every Tx Send A Msg Event----------//
                Ret_e = s_FMKFDCAN_SetHwBspCallbackStatus(idxNode_u8,
                                                        FMKFDCAN_BSP_TX_CB_BUFFER_COMPLETE,
                                                        FMKFDCAN_CALLBACK_STATUS_ACTIVATE);
            }
            if(Ret_e == RC_OK)
            {
                //---------- CallBack for Protocol Error----------//
                Ret_e = s_FMKFDCAN_SetHwBspCallbackStatus(idxNode_u8,
                                                        FMKFDCAN_BSP_CB_PROTOCOL_ERR,
                                                        FMKFDCAN_CALLBACK_STATUS_ACTIVATE);
            }
            if(Ret_e == RC_OK)
            {
                Ret_e = s_FMKFDCAN_SetNodeFilters();
            }
            if(Ret_e == RC_OK)
            {
                bspRet_e = HAL_FDCAN_Start(&g_NodeInfo_as[idxNode_u8].bspNode_s);
            }
            if(bspRet_e != HAL_OK)
            {
                Ret_e = RC_ERROR_WRONG_RESULT;
            }
            if(Ret_e == RC_OK)
            {
                //---------- Update Flag----------//
                g_NodeInfo_as[idxNode_u8].isNodeActive_b = (t_bool)True;

                Ret_e = APPSYS_SetFastTaskState(APPSYS_MODULE_FMK_CAN,
                                                APPSYS_FAST_TASK_ENABLE);
            }
        }
    }
    
    return Ret_e;
}

/*********************************
* s_FMKFDCAN_Operational
*********************************/
static t_eReturnCode s_FMKFDCAN_Operational(void)
{
    t_eReturnCode Ret_e =  RC_OK;
    t_uint8 idxNode_u8;
    t_sFMKFDCAN_NodeInfo * nodeInfo_ps;
    t_uint32 currenTime_u32;

    for(idxNode_u8 = (t_uint8)0 ; idxNode_u8 < FMKFDCAN_NODE_NB ; idxNode_u8++)
    {
        if(g_NodeInfo_as[idxNode_u8].isNodeConfigured_b == (t_bool)TRUE)
        {
            nodeInfo_ps = &g_NodeInfo_as[idxNode_u8];
            FMKCPU_GetTick(&currenTime_u32);
            // check flags for this Node
            if(nodeInfo_ps->Flag_s.ErrorDetected_b == (t_bool)TRUE)
            {
                //---- see if error is still active ----//
                if(nodeInfo_ps->nodeHealth_e != FMKFDCAN_NODE_STATE_OK)
                {
                    APPSDM_ReportDiagEvnt(  APPSDM_DIAG_ITEM_FMK_FDCAN_OPE_ERROR,
                                            APPSDM_DIAG_ITEM_REPORT_FAIL,
                                            idxNode_u8,
                                            nodeInfo_ps->nodeHealth_e);

                    //---- reset the node state ans see if callback still call us with errors ----//
                    if((currenTime_u32 - nodeInfo_ps->lastErrorCb_u32) > 100)
                    {
                        nodeInfo_ps->nodeHealth_e = FMKFDCAN_NODE_STATE_OK;
                    }
                }
                else 
                {
                    nodeInfo_ps->Flag_s.ErrorDetected_b = (t_bool)FALSE;
                    APPSDM_ReportDiagEvnt(  APPSDM_DIAG_ITEM_FMK_FDCAN_OPE_ERROR,
                                            APPSDM_DIAG_ITEM_REPORT_PASS,
                                            idxNode_u8,
                                            (t_uint16)0);
                }
                
                
