mbarbeau0545/STM32_FMKCAN/Src/FMK_FDCAN.c
            }
        }
    }

    return Ret_e;
}
/*****************************
* s_FMKFDCAN_BspTxEventCb
******************************/
static void s_FMKFDCAN_BspTxEventCb(FDCAN_HandleTypeDef *f_bspInfo_ps, 
                                    t_uint32 f_EvntCbInfo_u32, 
                                    t_eFMKFDCAN_BspCallbackList f_bspTxCallback_e)
{
    t_eReturnCode Ret_e = RC_OK;
    t_uint8 idxNode_u8;

    if(f_bspInfo_ps == (FDCAN_HandleTypeDef *)NULL)
    {
        Ret_e = RC_ERROR_PTR_NULL;
    }
    if(Ret_e == RC_OK)
    {
        for(idxNode_u8 = (t_uint8)0 ; idxNode_u8 < FMKFDCAN_NODE_NB ; idxNode_u8++)
        {
            if(&g_NodeInfo_as[idxNode_u8].bspNode_s == f_bspInfo_ps)
            {
                break;
            }
        }
        if(idxNode_u8 != FMKFDCAN_NODE_NB)
        {
            switch(f_bspTxCallback_e)
            {
                case FMKFDCAN_BSP_TX_CB_EVENT:
                {
                    break;
                }
                case FMKFDCAN_BSP_TX_CB_BUFFER_COMPLETE:
                case FMKFDCAN_BSP_TX_CB_FIFO_EMPTY:
                {
                    break;
                }
                case FMKFDCAN_BSP_TX_CB_BUFFER_ABORT:
                    g_NodeInfo_as[idxNode_u8].Flag_s.ErrorDetected_b = (t_bool)TRUE;
                    FMKCPU_GetTick(&g_NodeInfo_as[idxNode_u8].lastErrorCb_u32);
                    g_NodeInfo_as[idxNode_u8].nodeHealth_e = FMKFDCAN_NODE_STATE_ERR_HWTX_FIFO;
                    break;
                //---------Not Deal With This Function---------//
                case FMKFDCAN_BSP_RX_CB_FIFO_0:
                case FMKFDCAN_BSP_RX_CB_FIFO_1:
                case FMKFDCAN_BSP_CB_PROTOCOL_ERR:
                default:
                    break;
            }
        }
    }
}

/*****************************
* s_FMKFDCAN_BspRxEventCb
******************************/
static void s_FMKFDCAN_BspRxEventCb(FDCAN_HandleTypeDef *f_bspInfo_ps, 
                                    t_uint32 f_EvntCbInfo_u32, 
                                    t_eFMKFDCAN_BspCallbackList f_bspRxCallback_e)
{
    t_eReturnCode Ret_e = RC_OK;
    t_uint8 idxNode_u8;
    t_uint8 LLI_u8;
    t_uint8 nbItemLeftQueue_u8;
    t_uint8 nbMsgToTreat_u8 = (t_uint8)0;
    t_sFMKFDCAN_RxItemBuffer RxItemBuffer_s;
    t_sFMKFDCAN_NodeInfo * nodeInfos_ps = NULL;
    t_uint32 bspRxFifo_32 = (t_uint32)0;

    // First we try to found the Node that causes the interruption with f_bspInfo_ps
    // Then we try to found which FIFO xauses the interruption with f_bspRxCallback_e
    // Then if the flag MSG_RCV causes IT -> deal with it by calling callback or saved msg into software Rx Queue
    // If the flag FIFO_FULL causes IT -> Put X msg into Queue and Raise a flag to deal with them later
    if(f_bspInfo_ps == (FDCAN_HandleTypeDef *)NULL)
    {
        Ret_e = RC_ERROR_PTR_NULL;
    }
    if(Ret_e == RC_OK)
    {
        for(idxNode_u8 = (t_uint8)0 ; idxNode_u8 < FMKFDCAN_NODE_NB ; idxNode_u8++)
        {
            if(&g_NodeInfo_as[idxNode_u8].bspNode_s == f_bspInfo_ps)
            {
                nodeInfos_ps = (t_sFMKFDCAN_NodeInfo *)(&g_NodeInfo_as[idxNode_u8]);
                break;
            }
        }
        if((idxNode_u8 != FMKFDCAN_NODE_NB)
        && nodeInfos_ps != (t_sFMKFDCAN_NodeInfo *)NULL)
        {
            switch(f_bspRxCallback_e)
            {
                case FMKFDCAN_BSP_RX_CB_FIFO_0:
                    bspRxFifo_32 = FDCAN_RX_FIFO0;
                   
                    break;
                case FMKFDCAN_BSP_RX_CB_FIFO_1:
                {   
                    bspRxFifo_32 = FDCAN_RX_FIFO1;
                    break;
                }
                //---- not deal in this function ----//
                case FMKFDCAN_BSP_TX_CB_BUFFER_ABORT:
                case FMKFDCAN_BSP_CB_PROTOCOL_ERR:
                case FMKFDCAN_BSP_TX_CB_EVENT:
                case FMKFDCAN_BSP_TX_CB_BUFFER_COMPLETE:
                case FMKFDCAN_BSP_TX_CB_FIFO_EMPTY:
                case FMKFDCAN_BSP_CB_NB:
                default: 
                    break;
            }
            if(bspRxFifo_32 != (t_uint32)0)
            {
                nbMsgToTreat_u8 = HAL_FDCAN_GetRxFifoFillLevel(&nodeInfos_ps->bspNode_s,
                                                                bspRxFifo_32);
                switch(f_EvntCbInfo_u32)
                {
                    case FDCAN_IT_RX_FIFO0_FULL:
                    case FDCAN_IT_RX_FIFO1_FULL:
                        nodeInfos_ps->msgDiag_s.rxOverflow_u32++;
                    break;
                    
                    case FDCAN_IT_RX_FIFO0_NEW_MESSAGE:
                    case FDCAN_IT_RX_FIFO1_NEW_MESSAGE:
                        nodeInfos_ps->msgDiag_s.rxMsgReceived_u32++;
                    break;
                    case FDCAN_IT_RX_FIFO0_MESSAGE_LOST:
                    case FDCAN_IT_RX_FIFO1_MESSAGE_LOST:
                        nodeInfos_ps->Flag_s.ErrorDetected_b = (t_bool)TRUE;
                        nodeInfos_ps->nodeHealth_e = FMKFDCAN_NODE_STATE_ERR_HWRX_FIFO;
                        nodeInfos_ps->msgDiag_s.rxMsgDropped_u32++;
                        FMKCPU_GetTick(&nodeInfos_ps->lastErrorCb_u32);
                    break;
                    default:
                    break;
                }
            }

            LIBQUEUE_GetSizeLeft(&g_NodeInfo_as[idxNode_u8].RxSoftQueue_s, &nbItemLeftQueue_u8);
            
            if(nbItemLeftQueue_u8 < nbMsgToTreat_u8)
            {
                nodeInfos_ps->Flag_s.ErrorDetected_b = (t_bool)TRUE;
                nodeInfos_ps->nodeHealth_e = FMKFDCAN_NODE_STATE_ERR_SWRX_FIFO;
                FMKCPU_GetTick(&nodeInfos_ps->lastErrorCb_u32);
                ASSERT((t_uint16)nbItemLeftQueue_u8);

                //---- put a maximum of element ----//
                nbMsgToTreat_u8 = nbItemLeftQueue_u8;
            }
            for(LLI_u8 = (t_uint8)0; 
            (LLI_u8 < nbMsgToTreat_u8) 
             && (Ret_e == RC_OK) ; 
            LLI_u8++)
            {
                //--- may be reset rxItemBuffer container to 0 here ----//
                //---------Get a msg from Hardware Buffer---------//
                Ret_e = s_FMKFDCAN_RetrieveRxItem(  idxNode_u8, 
                                                    bspRxFifo_32,
                                                    &RxItemBuffer_s.bspRxItem_s,
                                                    RxItemBuffer_s.data_ua8);
                //---------Copy into buffer only if DataLenght <= 8---------//
                if(Ret_e == RC_OK)
                {
                    //--- WARNING maybe not good to stop fast task isr -----//
                    nodeInfos_ps->Flag_s.readOpe_b = (t_bool)TRUE;
                    Ret_e = LIBQUEUE_WriteElement(&nodeInfos_ps->RxSoftQueue_s, &RxItemBuffer_s, sizeof(RxItemBuffer_s));
                    nodeInfos_ps->Flag_s.readOpe_b = (t_bool)FALSE;
                    if(Ret_e != RC_OK)
                    {
                        ASSERT((t_uint16)Ret_e);
                    }
                }
            }
            //---------Flag RxFrame Pending ---------//
            if(nodeInfos_ps->Flag_s.RxQueuePending_b == (t_bool)FALSE)
            {
                nodeInfos_ps->Flag_s.RxQueuePending_b = (t_bool)TRUE;
            }
        }
    }

    return;
}

