mbarbeau0545/STM32_FMKCAN/Src/FMK_FDCAN.c
/*****************************
* s_FMKFDCAN_RetrieveRxItem
******************************/
static t_eReturnCode s_FMKFDCAN_RetrieveRxItem(t_eFMKFDCAN_NodeList f_Node_e,
                                                  t_uint32 f_BspRxFifo_u32,
                                                  FDCAN_RxHeaderTypeDef * f_bspRxItem_ps,
                                                  t_uint8 * f_bspData_pu8)
{
    t_eReturnCode Ret_e = RC_OK;
    HAL_StatusTypeDef bspRet_e = HAL_OK;

    //--------- Get Rx Msg From Hardware Fifo---------//
    bspRet_e = HAL_FDCAN_GetRxMessage(&g_NodeInfo_as[f_Node_e].bspNode_s, 
                            f_BspRxFifo_u32,
                            f_bspRxItem_ps,
                            f_bspData_pu8);

    if(bspRet_e != HAL_OK)
    {
        Ret_e = RC_ERROR_WRONG_RESULT;
    }
    
    return Ret_e;
}
/*****************************
* s_FMKFDCAN_SetBspNodeInit
******************************/
static t_eReturnCode s_FMKFDCAN_SetBspNodeInit(FDCAN_HandleTypeDef *f_bspInit_ps, t_sFMKFDCAN_DrvNodeCfg f_NodeCfg_s)
{
    t_eReturnCode Ret_e = RC_OK;
    t_eFMKFDCAN_Baudrate dataBaudrate_e;
    t_eFMKFDCAN_Baudrate frameBaudrate_e;
    t_uint32 bspTxQueueType_u32 = 0;
    t_uint32 bspClkDivider_u32 = 0;
    t_uint32 nominalPrescaler_u32 = 0;
    t_uint32 dataPrescaler_u32 = 0;
    if(f_bspInit_ps == (FDCAN_HandleTypeDef *)NULL)
    {
        Ret_e = RC_ERROR_PTR_NULL;
    }
    if(Ret_e == RC_OK)
    {
        //-------------------copy information -------------------//
        dataBaudrate_e = f_NodeCfg_s.DataBaudrate_e;
        frameBaudrate_e = f_NodeCfg_s.FrameBaudrate_e;
        //-------------------Get the Type-------------------//
        Ret_e = s_FMKFDCAN_GetBspQueueType(f_NodeCfg_s.QueueType_e, &bspTxQueueType_u32);
        if(Ret_e == RC_OK)
        {
            Ret_e = s_FMKFDCAN_GetClockKernelDivider(f_NodeCfg_s.clockDivider_e, &bspClkDivider_u32);
        }
        if(Ret_e == RC_OK)
        {
            //-------------------Global configuration Init -------------------//
            f_bspInit_ps->Init.ClockDivider = (t_uint32)bspClkDivider_u32;
            f_bspInit_ps->Init.Mode = FMKFDCAN_NODE_MODE;
            f_bspInit_ps->Init.AutoRetransmission = ENABLE;
            f_bspInit_ps->Init.TransmitPause = DISABLE;
            f_bspInit_ps->Init.ProtocolException = ENABLE;
            //--------------One per FIFO to allowed every ID----------//
            f_bspInit_ps->Init.StdFiltersNbr = (t_uint32)0; 
            f_bspInit_ps->Init.ExtFiltersNbr = (t_uint32)2;

            f_bspInit_ps->Init.TxFifoQueueMode = bspTxQueueType_u32;

            //-------------------Init for nominal baudrate-------------------//
            /* Information 
            *   Here in c_FmkCan_BspBaudrateCfg_as, the configuration has been made 
            *   for Clock Cfg (120Mhz), if user wants to divided this clock, in order to 
            *   obtain the right baudrate, we have to multiply the the value of the enum.\n
            *   In consequence no matter the clock divider value, the baudrate will always be 
            *   good 
            *   
            *   For Instance if the divider clock is Divided by FDCAN_CLOCK_DIV10, we multiply 
            *   the Nominal and Data precaler by FMKFDCAN_CLOCK_KERNEL_DIV10 (10)
            * 
            *   For record 
            *                                         Fclock (FMKFDCAN_SRC_CLOCK) (/ x)
            *  Baudrate =                        -----------------------------------------
            *                                   (Prescaler (* x)) * (SyncSeg + TimSeg1 + TimSeg2)
            */
            nominalPrescaler_u32 = (t_uint32)(c_FmkCan_BspBaudrateCfg_as[frameBaudrate_e].prescaler_u16 *
                                        f_NodeCfg_s.clockDivider_e);

            //-------------------copy information -------------------//            
            f_bspInit_ps->Init.NominalPrescaler = nominalPrescaler_u32;
            f_bspInit_ps->Init.NominalSyncJumpWidth = c_FmkCan_BspBaudrateCfg_as[frameBaudrate_e].syncSeg_u8;
            f_bspInit_ps->Init.NominalTimeSeg1 = c_FmkCan_BspBaudrateCfg_as[frameBaudrate_e].timeSeg1_u8;
            f_bspInit_ps->Init.NominalTimeSeg2 = c_FmkCan_BspBaudrateCfg_as[frameBaudrate_e].timeSeg2_u8;

            
            //-------------------depending on complete configuration-------------------// 
            switch(f_NodeCfg_s.ProtocolUse_e)
            {
                case FMKFDCAN_PROTOCOL_CAN2_0B:
                    f_bspInit_ps->Init.FrameFormat = FDCAN_FRAME_CLASSIC;
                    f_bspInit_ps->Init.DataPrescaler     = (t_uint32)0;
                    f_bspInit_ps->Init.DataSyncJumpWidth = (t_uint32)0;
                    f_bspInit_ps->Init.DataTimeSeg1      = (t_uint32)0;
                    f_bspInit_ps->Init.DataTimeSeg2      = (t_uint32)0;
                    break;

                case FMKFDCAN_PROTOCOL_FDCAN_BRS:
                    f_bspInit_ps->Init.FrameFormat = FDCAN_FRAME_FD_BRS;
                    //-------------------Init for Data Baudrate-------------//
                    dataPrescaler_u32 =  (t_uint32)(c_FmkCan_BspBaudrateCfg_as[dataBaudrate_e].prescaler_u16 * 
                                            f_NodeCfg_s.clockDivider_e);
                    f_bspInit_ps->Init.DataPrescaler = dataPrescaler_u32;
                    f_bspInit_ps->Init.DataSyncJumpWidth = c_FmkCan_BspBaudrateCfg_as[dataBaudrate_e].syncSeg_u8;
                    f_bspInit_ps->Init.DataTimeSeg1 = c_FmkCan_BspBaudrateCfg_as[dataBaudrate_e].timeSeg1_u8;
                    f_bspInit_ps->Init.DataTimeSeg2 = c_FmkCan_BspBaudrateCfg_as[dataBaudrate_e].timeSeg2_u8;
                    break;

                case  FMKFDCAN_PROTOCOL_FDCAN_NO_BRS:
                    f_bspInit_ps->Init.FrameFormat = FDCAN_FRAME_FD_NO_BRS;
                    f_bspInit_ps->Init.DataPrescaler     = (t_uint32)0;
                    f_bspInit_ps->Init.DataSyncJumpWidth = (t_uint32)0;
                    f_bspInit_ps->Init.DataTimeSeg1      = (t_uint32)0;
                    f_bspInit_ps->Init.DataTimeSeg2      = (t_uint32)0;
                    break;

                default:
                    Ret_e = RC_ERROR_NOT_SUPPORTED;
            }
        }
    }
    return Ret_e;
}

