mbarbeau0545/STM32_FMKCAN/Src/FMK_FDCAN.c
/*********************************
* s_FMKFDCAN_CopyBspRxItem
*********************************/
static t_eReturnCode s_FMKFDCAN_CopyBspRxItem(FDCAN_RxHeaderTypeDef *f_bspRxItem_ps,
                                              t_sFMKFDCAN_RxItemEvent * f_RxItem_ps,
                                              t_uint8 * f_bspData_pu8)
{
    t_eReturnCode Ret_e = RC_OK;
    t_eFMKFDCAN_DataLength Dlc_e;

    if(f_RxItem_ps == (t_sFMKFDCAN_RxItemEvent *)NULL)
    {
        Ret_e = RC_ERROR_PTR_NULL;
    }
    if(Ret_e == RC_OK)
    {
        
        //-------------------assemble the User Message-------------------//
        f_RxItem_ps->ItemId_s.Identifier_u32 = f_bspRxItem_ps->Identifier;
        f_RxItem_ps->timeStamp_32 = f_bspRxItem_ps->RxTimestamp;
        //------------------- If the message is Remote, there isn't data-------------------//
        if(f_bspRxItem_ps->RxFrameType == FDCAN_REMOTE_FRAME)
        {
            f_RxItem_ps->ItemId_s.FramePurpose_e = FMKFDCAN_FRAME_PURPOSE_REMOTE;
            f_RxItem_ps->CanMsg_s.data_pu8 = NULL;
            f_RxItem_ps->CanMsg_s.Dlc_e = FMKFDCAN_DLC_0;
            f_RxItem_ps->CanMsg_s.Direction_e = FMKFDCAN_NODE_DIRECTION_RX;
        }
        else
        {//-------------------else get Bspdlc -------------------//
            Ret_e = s_FMKFDCAN_GetDlcFromBsp(f_bspRxItem_ps->DataLength, &Dlc_e);
            if(Ret_e == RC_OK)
            {
                f_RxItem_ps->ItemId_s.FramePurpose_e = FMKFDCAN_FRAME_PURPOSE_DATA;
                f_RxItem_ps->CanMsg_s.data_pu8 = f_bspData_pu8;
                f_RxItem_ps->CanMsg_s.Dlc_e = Dlc_e;
                f_RxItem_ps->CanMsg_s.Direction_e = FMKFDCAN_NODE_DIRECTION_RX;
            }  
        }
        //------------------- Configure Identifier Type -> Extended or Standard-------------------//
        if(f_bspRxItem_ps->IdType == FDCAN_EXTENDED_ID)
        {
            f_RxItem_ps->ItemId_s.IdType_e = FMKFDCAN_IDTYPE_EXTENDED;
        }
        else 
        {
            f_RxItem_ps->ItemId_s.IdType_e = FMKFDCAN_IDTYPE_STANDARD;
        }
    }

    return Ret_e;
}

/*********************************
* s_FMKFDCAN_BspErrorEventCb
*********************************/
static void s_FMKFDCAN_BspErrorEventCb(FDCAN_HandleTypeDef *f_bspInfo_ps, 
                                              t_uint32 f_EvntCbInfo_u32)

{
    t_eReturnCode Ret_e = RC_OK;
    t_uint8 idxNode_u8 = 0;

    if(f_bspInfo_ps == (FDCAN_HandleTypeDef *)NULL)
    {
        Ret_e = RC_ERROR_PTR_NULL;
    }
    if(Ret_e == RC_OK)
    {
        for(idxNode_u8 = (t_uint8)0 ; idxNode_u8 < FMKFDCAN_NODE_NB ; idxNode_u8++)
        {
            if(&g_NodeInfo_as[idxNode_u8].bspNode_s == f_bspInfo_ps)
            {
                break;
            }
        }
        if(idxNode_u8 != FMKFDCAN_NODE_NB)
        {
            // update flag
            if(g_NodeInfo_as[idxNode_u8].Flag_s.ErrorDetected_b == (t_bool)FALSE)
            {
                g_NodeInfo_as[idxNode_u8].Flag_s.ErrorDetected_b = (t_bool)TRUE;
            }
            FMKCPU_GetTick(&g_NodeInfo_as[idxNode_u8].lastErrorCb_u32);

            switch(f_EvntCbInfo_u32)
            {
                case HAL_FDCAN_ERROR_NONE:
                    g_NodeInfo_as[idxNode_u8].nodeHealth_e = FMKFDCAN_NODE_STATE_OK;
                    break;
                case HAL_FDCAN_ERROR_NOT_STARTED:
                    g_NodeInfo_as[idxNode_u8].nodeHealth_e = FMKFDCAN_NODE_STATE_NOT_STARTED;
                    break;
                case HAL_FDCAN_ERROR_NOT_INITIALIZED:
                    g_NodeInfo_as[idxNode_u8].nodeHealth_e = FMKFDCAN_NODE_STATE_NOT_INIT;
                    break;
                case HAL_FDCAN_ERROR_NOT_READY:
                    g_NodeInfo_as[idxNode_u8].nodeHealth_e = FMKFDCAN_NODE_STATE_NOT_READY;
                    break;
                case HAL_FDCAN_ERROR_PARAM:
                    g_NodeInfo_as[idxNode_u8].nodeHealth_e = FMKFDCAN_NODE_STATE_PARAM;
                    break;
                case HAL_FDCAN_ERROR_NOT_SUPPORTED:
                    g_NodeInfo_as[idxNode_u8].nodeHealth_e = FMKFDCAN_NODE_STATE_NOT_SUPPORTED;
                    break;
                case HAL_FDCAN_ERROR_TIMEOUT:
                    g_NodeInfo_as[idxNode_u8].nodeHealth_e = FMKFDCAN_NODE_STATE_TIMEOUT;
                    break;
                case HAL_FDCAN_ERROR_FIFO_FULL:
                    g_NodeInfo_as[idxNode_u8].nodeHealth_e = FMKFDCAN_NODE_STATE_ERR_HWTX_FIFO;
                    break;
                case HAL_FDCAN_ERROR_PROTOCOL_ARBT:
                    g_NodeInfo_as[idxNode_u8].nodeHealth_e = FMKFDCAN_NODE_STATE_PROTOCOL_ARBT;
                    break;
                case HAL_FDCAN_ERROR_PROTOCOL_DATA:
                    g_NodeInfo_as[idxNode_u8].nodeHealth_e = FMKFDCAN_NODE_STATE_PROTOCOL_DATA;
                    break;
                case HAL_FDCAN_ERROR_LOG_OVERFLOW:
                    g_NodeInfo_as[idxNode_u8].nodeHealth_e = FMKFDCAN_NODE_STATE_LOG_OVERFLOW;
                    break;
                case HAL_FDCAN_ERROR_RAM_ACCESS:
                    g_NodeInfo_as[idxNode_u8].nodeHealth_e = FMKFDCAN_NODE_STATE_RAM_ACCESS;
                    break;
                case HAL_FDCAN_ERROR_PENDING:
                    g_NodeInfo_as[idxNode_u8].nodeHealth_e = FMKFDCAN_NODE_STATE_PENDING;
                    break;
                case HAL_FDCAN_ERROR_RESERVED_AREA:
                    g_NodeInfo_as[idxNode_u8].nodeHealth_e = FMKFDCAN_NODE_STATE_RESERVED_AREA;
                    break;
                case HAL_FDCAN_ERROR_RAM_WDG:
                    g_NodeInfo_as[idxNode_u8].nodeHealth_e = FMKFDCAN_NODE_STATE_RAM_WDG;
                    break;
                case HAL_FDCAN_ERROR_FIFO_EMPTY:
                default:
                    Ret_e = RC_OK;
            }   
        }
    }

    return;
}
/*********************************
* s_FMKFDCAN_CopyBspTxItem
*********************************/
static t_eReturnCode s_FMKFDCAN_CopyBspTxItem(t_sFMKFDCAN_TxItem *f_TxItemCfg_s, FDCAN_TxHeaderTypeDef *f_bspTxItem_ps)
{
    t_eReturnCode Ret_e = RC_OK;
    t_uint32 bspFramePurpose_u32;
    t_uint32 bspDlc_u32;
    t_uint32 bspFDFormat_u32;
    t_uint32 bspIdType_u32;
    t_uint32 bspBitRateStatus_u32;

    if (f_bspTxItem_ps == (FDCAN_TxHeaderTypeDef *)NULL)
    {
        Ret_e = RC_ERROR_PTR_NULL;
    }
    if(Ret_e == RC_OK)
    {   
        //-------------------Get all Bsp Variable from enum-------------------//
        Ret_e = s_FMKFDCAN_GetBspDlc(f_TxItemCfg_s->CanMsg_s.Dlc_e, &bspDlc_u32);
        if(Ret_e == RC_OK)
        {
            Ret_e = s_FMKFDCAN_GetBspFDFormat(f_TxItemCfg_s->frameFormat_e, &bspFDFormat_u32);
        }
        if(Ret_e == RC_OK)
        {
            Ret_e = s_FMKFDCAN_GetBspIdType(f_TxItemCfg_s->ItemId_s.IdType_e, &bspIdType_u32);
        }
        if(Ret_e == RC_OK)
        {
            Ret_e = s_FMKFDCAN_GetBspFramePurpose(f_TxItemCfg_s->ItemId_s.FramePurpose_e, &bspFramePurpose_u32);
        }
        if(Ret_e == RC_OK)
        {
            Ret_e = s_FMKFDCAN_GetBspBitRateStatus(f_TxItemCfg_s->BitRate_e, &bspBitRateStatus_u32);
        }
        if(Ret_e == RC_OK)
        {
            //------------------- Copy bsp Tx Item structure-------------------//
            f_bspTxItem_ps->Identifier          = (t_uint32)f_TxItemCfg_s->ItemId_s.Identifier_u32;
            f_bspTxItem_ps->IdType              = (t_uint32)bspIdType_u32;
            f_bspTxItem_ps->BitRateSwitch       = (t_uint32)bspBitRateStatus_u32;
            f_bspTxItem_ps->DataLength          = (t_uint32)bspDlc_u32;
            f_bspTxItem_ps->FDFormat            = (t_uint32)bspFDFormat_u32;
            f_bspTxItem_ps->TxEventFifoControl  = (t_uint32)FDCAN_NO_TX_EVENTS;
            f_bspTxItem_ps->TxFrameType         = (t_uint32)bspFramePurpose_u32;
            f_bspTxItem_ps->MessageMarker       = (t_uint32)0;
            f_bspTxItem_ps->ErrorStateIndicator = (t_uint32)0;
        }
    }

    return Ret_e;
}

