mbarbeau0545/STM32_FMKCAN/Src/FMK_FDCAN.c
/*********************************
* s_FMKFDCAN_UserCallbackMngmt
*********************************/
static t_eReturnCode s_FMKFDCAN_UserCallbackMngmt(  t_eFMKFDCAN_NodeList f_Node_e,
                                                    t_sFMKFDCAN_RxItemEvent * f_RxItemEvnt_ps)
{
    t_eReturnCode Ret_e = RC_OK;
    t_uint8 idxUserRgstr_u8;
    t_sFMKFDCAN_UserItemSub * subInfo_ps;
    t_sFMKFDCAN_NodeInfo * nodeInfo_ps;

    if((f_Node_e >=  FMKFDCAN_NODE_NB)
    || (f_RxItemEvnt_ps == (t_sFMKFDCAN_RxItemEvent *)NULL))
    {
        ASSERT((t_uint16)0);
        Ret_e = RC_ERROR_PARAM_INVALID;
    }
    if(Ret_e == RC_OK)
    {
        nodeInfo_ps = (t_sFMKFDCAN_NodeInfo *)(&g_NodeInfo_as[f_Node_e]);
        //-------------------Find User Information-------------------//
        // Loop until the number of registration done 
        // We enter in the condition if the mask applied to f_Identifier_u32
        // is equals to an identifier register while appliyng the same mask
        // For instance 
        //
        // f_Identifier_u32     mask_u32
        // 0b11010100       & 0b11110000 = 0b11010000
        // 0b11010011       & 0b11110000 = 0b11010000 
        // Works -> We enter in condition
        for(idxUserRgstr_u8 = (t_uint8)0; idxUserRgstr_u8 < nodeInfo_ps->nbSubscriptions_u8 ; idxUserRgstr_u8++)
        {
            subInfo_ps = (t_sFMKFDCAN_UserItemSub *)(&nodeInfo_ps->userSubInfo_pas[idxUserRgstr_u8]);

            if ((f_RxItemEvnt_ps->ItemId_s.Identifier_u32 & subInfo_ps->maskId_u32) == 
                (subInfo_ps->itemId_s.Identifier_u32 & subInfo_ps->maskId_u32)
                )
            {
                nodeInfo_ps->userSubInfo_pas[idxUserRgstr_u8].rcvItem_cb(   f_Node_e, 
                                                                            *f_RxItemEvnt_ps, 
                                                                            nodeInfo_ps->nodeHealth_e);
            }
        }
    }

    return Ret_e;
}

/************************************
* s_FMKFDCAN_SetHwBspCallbackStatus
***********************************/
static t_eReturnCode s_FMKFDCAN_SetNodeFilters(void)
{
    t_eReturnCode Ret_e = RC_OK;
    FDCAN_FilterTypeDef bspFilter_s;
    t_uint8 idxNode_u8;
    HAL_StatusTypeDef bspRet_e = HAL_OK;

    #warning('Filter are for Extended ID, please change following line if Node is use in Standard Mode, Think to also changed bspInit FilerNb')
    bspFilter_s.IdType = FDCAN_EXTENDED_ID;
    bspFilter_s.FilterIndex = 0;                 // Index du filtre
    bspFilter_s.FilterType = FDCAN_FILTER_MASK;  // Type de filtre
    bspFilter_s.FilterID1 = 0x000;               // ID accepté
    bspFilter_s.FilterID2 = 0x000;               // Masque (toutes les trames)

    for( idxNode_u8 = (t_uint8)0 ; (idxNode_u8 < FMKFDCAN_NODE_NB) && (Ret_e == RC_OK) ; idxNode_u8++)
    {
        if(g_NodeInfo_as[idxNode_u8].isNodeConfigured_b == (t_bool)True)
        {
            bspFilter_s.FilterConfig = FDCAN_FILTER_TO_RXFIFO0;
            bspRet_e = HAL_FDCAN_ConfigFilter(&g_NodeInfo_as[idxNode_u8].bspNode_s, &bspFilter_s);
            if(bspRet_e == HAL_OK)
            {
                bspFilter_s.FilterConfig = FDCAN_FILTER_TO_RXFIFO1;
                bspRet_e = HAL_FDCAN_ConfigFilter(&g_NodeInfo_as[idxNode_u8].bspNode_s, &bspFilter_s);
            }
        }
        if(bspRet_e != HAL_OK)
        {
            Ret_e = RC_ERROR_WRONG_RESULT;
        }
    }   

    return Ret_e;
}
/************************************
* s_FMKFDCAN_SetHwBspCallbackStatus
***********************************/
static t_eReturnCode s_FMKFDCAN_SetHwBspCallbackStatus(t_eFMKFDCAN_NodeList f_Node_e ,
                                                        t_eFMKFDCAN_BspCallbackList f_bspCb_e,
                                                        t_eFMKFDCAN_BspStatusCb f_status_e)
{
    t_eReturnCode Ret_e = RC_OK;
    HAL_StatusTypeDef bspRet_e = HAL_OK;
    t_uint32 bspCbId_u32;
    t_uint32 bspFifo_u32;
    t_uint8 idxTxFifo_u8;

    if((f_bspCb_e >= FMKFDCAN_BSP_CB_NB)
    || (f_status_e >= FMKFDCAN_CALLBACK_STATUS_NB))
    {
        Ret_e = RC_ERROR_PARAM_INVALID;
    }
    if(Ret_e == RC_OK)
    {
        Ret_e = s_FMKFDCAN_GetBspCallbackId(f_bspCb_e, &bspCbId_u32);
    }
    if(Ret_e == RC_OK)
    {
        if (g_BspCbMngmt_ae[f_Node_e][f_bspCb_e] != f_status_e)
        {
            
            switch(f_status_e)
            {
                case FMKFDCAN_CALLBACK_STATUS_ACTIVATE:
                {
                    // according datasheet, if IT_Tx is in the loop, 
                    // specify the TxFifo 
                    // Here we activate interruption on all Fifo
                    if((bspCbId_u32 == FDCAN_IT_TX_COMPLETE)
                    || bspCbId_u32 == FDCAN_IT_TX_ABORT_COMPLETE)
                    {
                        for(idxTxFifo_u8 = (t_uint8)0 ; idxTxFifo_u8 < FMKFDCAN_HW_TX_BUFFER_NB ; idxTxFifo_u8++)
                        {
                            Ret_e = s_FMKFDCAN_GetBspTxFifoId(idxTxFifo_u8, &bspFifo_u32);
                            if(Ret_e == RC_OK)
                            {
                                bspRet_e = HAL_FDCAN_ActivateNotification(&g_NodeInfo_as[f_Node_e].bspNode_s,
                                                                        (t_uint32)bspCbId_u32,
                                                                        (t_uint32)bspFifo_u32);
                            }
                        }  
                    }
                    else
                    {
                        bspRet_e = HAL_FDCAN_ActivateNotification(&g_NodeInfo_as[f_Node_e].bspNode_s,
                                                                        (t_uint32)bspCbId_u32,
                                                                        (t_uint32)NULL);
                    }
                    break;
                }
                case FMKFDCAN_CALLBACK_STATUS_DEACTIVATE:
                {
                    bspRet_e = HAL_FDCAN_DeactivateNotification(&g_NodeInfo_as[f_Node_e].bspNode_s,
                                                                bspCbId_u32);
                    break;
                }
                case FMKFDCAN_CALLBACK_STATUS_NB:
                default:
                    Ret_e = RC_ERROR_NOT_SUPPORTED;
                    break;
            }
            if(bspRet_e != HAL_OK)
            {
                Ret_e = RC_ERROR_WRONG_RESULT;
            }
            if(Ret_e == RC_OK)
            {
                //------------------Update Flag for this Bsp Callback------------------//
                g_BspCbMngmt_ae[f_Node_e][f_bspCb_e] = f_status_e;
            }
        }
    }

    return Ret_e;
}

