mbarbeau0545/STM32_FMKCAN/Src/FMK_FDCAN.c
/*****************************
* s_FMKFDCAN_SetHwFifoOpeMode
******************************/
static t_eReturnCode s_FMKFDCAN_SetHwFifoOpeMode(t_eFMKFDCAN_NodeList f_Node_e ,t_eFMKFDCAN_FifoOpeMode f_fifoMode_e)
{
    t_eReturnCode Ret_e = RC_OK;
    t_uint8 idxFifo_u8 = 0;
    t_uint32 bspFifo_u32;
    t_uint32 bspFifoOpeMode_u32;
    HAL_StatusTypeDef bspRet_e = HAL_OK;

    if(f_fifoMode_e >= FMKFDCAN_FIFO_OPEMODE_NB)
    {
        Ret_e = RC_ERROR_PARAM_INVALID;
    }
    if(Ret_e == RC_OK)
    {
        //---------We loop for every Hardware Can FIfo and set the same Fifo Operation Mode---------//
        for (idxFifo_u8 = (t_uint8)0 ; (idxFifo_u8 < FMKFDCAN_HW_RX_FIFO_NB) && (Ret_e == RC_OK); idxFifo_u8++)    
        {
            Ret_e = s_FMKFDCAN_GetBspRxFifoId(idxFifo_u8, &bspFifo_u32);
            if(Ret_e == RC_OK)
            {
                Ret_e = s_FMKFDCAN_GetBspFifoOpeMode(f_fifoMode_e, &bspFifoOpeMode_u32);
                
            }
            if(Ret_e == RC_OK)
            {
                //---------Call Bsp Function to configure FIFO/QUEUE mode---------//
                bspRet_e = HAL_FDCAN_ConfigRxFifoOverwrite(&g_NodeInfo_as[f_Node_e].bspNode_s, 
                                                            bspFifo_u32, 
                                                            bspFifoOpeMode_u32);
            }
            if(bspRet_e != HAL_OK)
            {
                Ret_e = RC_ERROR_WRONG_RESULT;
            }
        }
    }
    return Ret_e;
}

/*****************************
* s_FMKFDCAN_GetBspFramePurpose
******************************/
static void s_FMKFDCAN_FastTask(void)
{
    t_eReturnCode Ret_e;
    t_uint8 idxNode_u8;
    t_sFMKFDCAN_NodeInfo * nodeInfo_ps;

    //---- loop on every node ----//
    for(idxNode_u8 = (t_uint8)0 ; idxNode_u8 < FMKFDCAN_NODE_NB ; idxNode_u8++)
    {
        nodeInfo_ps = (t_sFMKFDCAN_NodeInfo *)(&g_NodeInfo_as[idxNode_u8]);

        if(nodeInfo_ps->isNodeActive_b == (t_bool)TRUE)
        {
            if((nodeInfo_ps->Flag_s.TxQueuePending_b == (t_bool)TRUE)
            || (nodeInfo_ps->Flag_s.TxFramePrioPending_b == (t_bool)TRUE))
            {
                //--- maybe deactivate Tx Callback while performing on queue 
                //      we not doing anything on it so for now do nothing -----//
                Ret_e = s_FMKFDCAN_FastTask_TxFifoMngmt((t_eFMKFDCAN_NodeList)idxNode_u8);

                if(Ret_e < RC_OK)
                {
                    ASSERT((t_uint16)Ret_e);
                }
            }
            if(nodeInfo_ps->Flag_s.RxQueuePending_b == (t_bool)TRUE)
            {
                //---- deactivate Rx Callback fifo 1, 2 to operate on  queue and not be disturb ----//
                (void)s_FMKFDCAN_SetHwBspCallbackStatus((t_eFMKFDCAN_NodeList)idxNode_u8,
                                                        FMKFDCAN_BSP_RX_CB_FIFO_0,
                                                        FMKFDCAN_CALLBACK_STATUS_DEACTIVATE);
                (void)s_FMKFDCAN_SetHwBspCallbackStatus((t_eFMKFDCAN_NodeList)idxNode_u8,
                                                        FMKFDCAN_BSP_RX_CB_FIFO_1,
                                                        FMKFDCAN_CALLBACK_STATUS_DEACTIVATE);
                Ret_e = s_FMKFDCAN_FastTask_RxFifoMngmt((t_eFMKFDCAN_NodeList)idxNode_u8);
                //---- Reactivate Rx Callback fifo 1, 2 to get new Message ----//
                (void)s_FMKFDCAN_SetHwBspCallbackStatus((t_eFMKFDCAN_NodeList)idxNode_u8,
                                                        FMKFDCAN_BSP_RX_CB_FIFO_0,
                                                        FMKFDCAN_CALLBACK_STATUS_ACTIVATE);
                (void)s_FMKFDCAN_SetHwBspCallbackStatus((t_eFMKFDCAN_NodeList)idxNode_u8,
                                                        FMKFDCAN_BSP_RX_CB_FIFO_1,
                                                        FMKFDCAN_CALLBACK_STATUS_ACTIVATE);
                if(Ret_e < RC_OK)
                {
                    ASSERT((t_uint16)Ret_e);
                }
            }
        }
    }

    return;
}

/*********************************
* s_FMKFDCAN_FastTask_TxFifoMngmt
**********************************/
static t_eReturnCode s_FMKFDCAN_FastTask_TxFifoMngmt(t_eFMKFDCAN_NodeList f_node_e)
{
    t_eReturnCode Ret_e;
    t_sFMKFDCAN_NodeInfo * nodeInfo_ps;
    t_sFMKFDCAN_TxItemBuffer SoftTxItem_s;
    HAL_StatusTypeDef bspRet_e;
    t_uint8 TxQueueSize_u8 = (t_uint8)0;
    t_uint8 msgProcessed_u8 = (t_uint8)0;
    t_uint32 bspFifoLvl_u32 = (t_uint32)0;

    if(f_node_e >= FMKFDCAN_NODE_NB)
    {
        Ret_e = RC_ERROR_PARAM_INVALID;
    }
    else
    {
        Ret_e = RC_OK;
        nodeInfo_ps = (t_sFMKFDCAN_NodeInfo *)(&g_NodeInfo_as[f_node_e]);

        LIBQUEUE_GetActualSize(&nodeInfo_ps->TxSoftQueue_s, &TxQueueSize_u8);

        //---------Process messages from the queue, respecting the maximum limit per interrupt---------//                        
        while ((TxQueueSize_u8  > (t_uint8)0) 
            && (msgProcessed_u8 < (t_uint8)FMKFDCAN_MAX_TX_ITEM_SEND_PER_IT)
            && (Ret_e == RC_OK))
        {
            bspFifoLvl_u32 = HAL_FDCAN_GetTxFifoFreeLevel(&nodeInfo_ps->bspNode_s);

            if(bspFifoLvl_u32 == (t_uint32)0)
            {
                break;
            }
            else
            {
                //---------Read an element from the queue---------//
                Ret_e = LIBQUEUE_ReadElement(&nodeInfo_ps->TxSoftQueue_s, &SoftTxItem_s, sizeof(SoftTxItem_s));
                if (Ret_e != RC_OK)
                {
                    //---------Exit loop on read failure---------//
                    ASSERT((t_uint16)Ret_e);
                    break;
                }

                //---------Attempt to send the message to the hardware buffer---------//
                bspRet_e = HAL_FDCAN_AddMessageToTxFifoQ(&nodeInfo_ps->bspNode_s,
                                                        &SoftTxItem_s.bspTxItem_s,
                                                        SoftTxItem_s.data_ua8);
                if (bspRet_e != HAL_OK)
                {
                    Ret_e = RC_ERROR_WRONG_RESULT;
                    break;
                }
                else 
                {
                    nodeInfo_ps->msgDiag_s.txMsgSend_u32++;
                }

                //---------Increment processed message count---------//
                msgProcessed_u8++;
                //---------Update the queue size---------//
                LIBQUEUE_GetActualSize(&nodeInfo_ps->TxSoftQueue_s, &TxQueueSize_u8);
            }
        }

        //---------If the queue is empty, update the flag---------//
        if (TxQueueSize_u8 == 0)
        {                                                    
            nodeInfo_ps->Flag_s.TxQueuePending_b = (t_bool)False;
        }
    }

    return Ret_e;
}

/**********************************
* s_FMKFDCAN_FastTask_TxFifoMngmt
***********************************/
static t_eReturnCode s_FMKFDCAN_FastTask_RxFifoMngmt(t_eFMKFDCAN_NodeList f_node_e)
{
    t_eReturnCode Ret_e;
    t_sFMKFDCAN_NodeInfo * nodeInfo_ps;
    t_sFMKFDCAN_RxItemBuffer SoftRxItem_s;
    t_sFMKFDCAN_RxItemEvent rxItemEvnt_s;
    t_uint8 idxSubscription_u8 = (t_uint8)0;
    t_uint8 RxQueueSize_u8 = (t_uint8)0;
    t_uint8 msgProcessed_u8 = (t_uint8)0;

