mbarbeau0545/STM32_FMKCAN/Src/FMK_FDCAN.c
    if(f_node_e >= FMKFDCAN_NODE_NB)
    {
        Ret_e = RC_ERROR_PARAM_INVALID;
    }
    else
    {
        Ret_e = RC_OK;
        nodeInfo_ps = (t_sFMKFDCAN_NodeInfo *)(&g_NodeInfo_as[f_node_e]);
        LIBQUEUE_GetActualSize(&nodeInfo_ps->RxSoftQueue_s, &RxQueueSize_u8);

        while ((RxQueueSize_u8  > (t_uint8)0) 
            && (msgProcessed_u8 < (t_uint8)FMKFDCAN_MAX_TX_ITEM_SEND_PER_IT)
            && (Ret_e == RC_OK))
        {
            //---- get on element from the queue ----//
            Ret_e = LIBQUEUE_ReadElement(   &nodeInfo_ps->RxSoftQueue_s,
                                            &SoftRxItem_s,
                                            sizeof(t_sFMKFDCAN_RxItemBuffer));
                
            if(Ret_e == RC_OK)
            {
                Ret_e = s_FMKFDCAN_CopyBspRxItem(&SoftRxItem_s.bspRxItem_s, 
                                                &rxItemEvnt_s,
                                                SoftRxItem_s.data_ua8);
            }
            if(Ret_e == RC_OK)
            {
                //---------Find in Registration the Registerindex of the ItemId---------//
                Ret_e = s_FMKFDCAN_UserCallbackMngmt(   f_node_e,
                                                        &rxItemEvnt_s);
            }
            if(Ret_e != RC_OK)
            {
                if(nodeInfo_ps->Flag_s.ErrorDetected_b == (t_bool)FALSE)
                {
                    nodeInfo_ps->Flag_s.ErrorDetected_b = (t_bool)TRUE;
                    nodeInfo_ps->nodeHealth_e = FMKFDCAN_NODE_STATE_ERR_SWRX_FIFO;
                    FMKCPU_GetTick(&nodeInfo_ps->lastErrorCb_u32);
                }
                nodeInfo_ps->msgDiag_s.rxMsgDropped_u32++;
            }
            else 
            {
                nodeInfo_ps->msgDiag_s.rxMsgProcess_u32++;
            }

            //---- update Rx Queue size ----//
            msgProcessed_u8++;
            //---------Update the queue size---------//
            LIBQUEUE_GetActualSize(&nodeInfo_ps->RxSoftQueue_s, &RxQueueSize_u8);
        }
        if(RxQueueSize_u8 == (t_uint8)0)
        {
            nodeInfo_ps->Flag_s.RxQueuePending_b = (t_bool)FALSE;
        }
    }

    return Ret_e;
}

/*****************************
* s_FMKFDCAN_GetBspFramePurpose
******************************/
static t_eReturnCode s_FMKFDCAN_GetBspFramePurpose(t_eFMKFDCAN_FramePurpose f_frameType_e, t_uint32 *f_bspFramePurpose_pu32)
{
    t_eReturnCode Ret_e = RC_OK;

    if(f_frameType_e >= FMKFDCAN_FRAME_PURPOSE_NB)
    {
        Ret_e = RC_ERROR_PARAM_INVALID;
    }
    if(f_bspFramePurpose_pu32 == (t_uint32 *)NULL)
    {
        Ret_e = RC_ERROR_PTR_NULL;
    }
    if(Ret_e == RC_OK)
    {
        switch(f_frameType_e)
        {
            case FMKFDCAN_FRAME_PURPOSE_DATA:
                *f_bspFramePurpose_pu32 = FDCAN_DATA_FRAME;
                break;

            case FMKFDCAN_FRAME_PURPOSE_REMOTE:
                *f_bspFramePurpose_pu32 = FDCAN_REMOTE_FRAME;
                break;

            case FMKFDCAN_FRAME_PURPOSE_NB:
            default:
                Ret_e = RC_ERROR_NOT_SUPPORTED;
        }
    }
    
    return Ret_e;
}
/*****************************
* s_FMKFDCAN_GetBspIdType
******************************/
static t_eReturnCode s_FMKFDCAN_GetBspIdType(t_eFMKFDCAN_IdentifierType f_IdType, t_uint32 *f_bspIdType_pu32)
{
    t_eReturnCode Ret_e = RC_OK;

    if(f_IdType >= FMKFDCAN_IDTYPE_NB)
    {
        Ret_e = RC_ERROR_PARAM_INVALID;
    }
    if(f_bspIdType_pu32 == (t_uint32 *)NULL)
    {
        Ret_e = RC_ERROR_PTR_NULL;
    }
    if(Ret_e == RC_OK)
    {
        switch(f_IdType)
        {
            case FMKFDCAN_IDTYPE_STANDARD:
                *f_bspIdType_pu32 = FDCAN_STANDARD_ID;
                break;

            case FMKFDCAN_IDTYPE_EXTENDED:
                *f_bspIdType_pu32 = FDCAN_EXTENDED_ID;
                break;

            case FMKFDCAN_FRAME_PURPOSE_NB:
            default:
                Ret_e = RC_ERROR_NOT_SUPPORTED;
        }
    }
    
    return Ret_e;
}

/********************************
* s_FMKFDCAN_GetBspBitRateStatus
********************************/
static t_eReturnCode s_FMKFDCAN_GetBspBitRateStatus(t_eFMKFDCAN_BitRateSwitchStatus f_BitRate_e, t_uint32 *f_BspBitRate_pu32)
{
    t_eReturnCode Ret_e = RC_OK;

    if(f_BitRate_e >= FMKFDCAN_BITRATE_SWITCH_NB)
    {
        Ret_e = RC_ERROR_PARAM_INVALID;
    }
    if(f_BspBitRate_pu32 == (t_uint32 *)NULL)
    {
        Ret_e = RC_ERROR_PTR_NULL;
    }
    if(Ret_e == RC_OK)
    {
        switch(f_BitRate_e)
        {
            case FMKFDCAN_BITRATE_SWITCH_ON:
                *f_BspBitRate_pu32 = FDCAN_BRS_ON;
                break;

            case FMKFDCAN_BITRATE_SWITCH_OFF:
                *f_BspBitRate_pu32 = FDCAN_BRS_OFF;
                break;

            case FMKFDCAN_FRAME_PURPOSE_NB:
            default:
                Ret_e = RC_ERROR_NOT_SUPPORTED;
        }
    }
    
    return Ret_e;
}

/*****************************
* s_FMKFDCAN_GetBspDlc
******************************/
static t_eReturnCode s_FMKFDCAN_GetBspDlc(t_eFMKFDCAN_DataLength f_Dlc_e, t_uint32 *f_BspDlc_pu32)
{
    t_eReturnCode Ret_e = RC_OK;

    if(f_Dlc_e >= FMKFDCAN_DLC_NB)
    {
        Ret_e = RC_ERROR_PARAM_INVALID;
    }
    if(f_BspDlc_pu32 == (t_uint32 *)NULL)
    {
        Ret_e = RC_ERROR_PTR_NULL;
    }
    if(Ret_e == RC_OK)
    {
        switch (f_Dlc_e)
        {
            case FMKFDCAN_DLC_0:
                *f_BspDlc_pu32 = FDCAN_DLC_BYTES_0;
                break;
            case FMKFDCAN_DLC_1:
                *f_BspDlc_pu32 = FDCAN_DLC_BYTES_1;
                break;
            case FMKFDCAN_DLC_2:
                *f_BspDlc_pu32 = FDCAN_DLC_BYTES_2;
                break;
            case FMKFDCAN_DLC_3:
                *f_BspDlc_pu32 = FDCAN_DLC_BYTES_3;
                break;
            case FMKFDCAN_DLC_4:
                *f_BspDlc_pu32 = FDCAN_DLC_BYTES_4;
                break;
            case FMKFDCAN_DLC_5:
                *f_BspDlc_pu32 = FDCAN_DLC_BYTES_5;
                break;
            case FMKFDCAN_DLC_6:
                *f_BspDlc_pu32 = FDCAN_DLC_BYTES_6;
                break;
            case FMKFDCAN_DLC_7:
                *f_BspDlc_pu32 = FDCAN_DLC_BYTES_7;
                break;
            case FMKFDCAN_DLC_8:
                *f_BspDlc_pu32 = FDCAN_DLC_BYTES_8;
                break;
            case FMKFDCAN_DLC_16:
                *f_BspDlc_pu32 = FDCAN_DLC_BYTES_16;
                break;
            case FMKFDCAN_DLC_20:
                *f_BspDlc_pu32 = FDCAN_DLC_BYTES_20;
                break;
            case FMKFDCAN_DLC_24:
                *f_BspDlc_pu32 = FDCAN_DLC_BYTES_24;
                break;
            case FMKFDCAN_DLC_32:
                *f_BspDlc_pu32 = FDCAN_DLC_BYTES_32;
                break;
            case FMKFDCAN_DLC_48:
                *f_BspDlc_pu32 = FDCAN_DLC_BYTES_48;
                break;
            case FMKFDCAN_DLC_64:
                *f_BspDlc_pu32 = FDCAN_DLC_BYTES_64;
                break;

            case FMKFDCAN_DLC_NB:
            default:
                Ret_e = RC_ERROR_NOT_SUPPORTED;
                break;
        }
    }
    
    return Ret_e;
}

