mbarbeau0545/STM32_FMKCAN/Src/FMK_FDCAN.c
/*****************************
* s_FMKFDCAN_GetDlcFromBsp
******************************/
static t_eReturnCode s_FMKFDCAN_GetDlcFromBsp(t_uint32 f_BspDlc_u32, t_eFMKFDCAN_DataLength *f_Dlc_pe)
{
    t_eReturnCode Ret_e = RC_OK;

    if(f_Dlc_pe == (t_eFMKFDCAN_DataLength *)NULL)
    {
        Ret_e = RC_ERROR_PTR_NULL;
    }
    else
    {
        switch (f_BspDlc_u32)
        {
            case FDCAN_DLC_BYTES_0:
                *f_Dlc_pe = FMKFDCAN_DLC_0;
                break;
            case FDCAN_DLC_BYTES_1:
                *f_Dlc_pe = FMKFDCAN_DLC_1;
                break;
            case FDCAN_DLC_BYTES_2:
                *f_Dlc_pe = FMKFDCAN_DLC_2;
                break;
            case FDCAN_DLC_BYTES_3:
                *f_Dlc_pe = FMKFDCAN_DLC_3;
                break;
            case FDCAN_DLC_BYTES_4:
                *f_Dlc_pe = FMKFDCAN_DLC_4;
                break;
            case FDCAN_DLC_BYTES_5:
                *f_Dlc_pe = FMKFDCAN_DLC_5;
                break;
            case FDCAN_DLC_BYTES_6:
                *f_Dlc_pe = FMKFDCAN_DLC_6;
                break;
            case FDCAN_DLC_BYTES_7:
                *f_Dlc_pe = FMKFDCAN_DLC_7;
                break;
            case FDCAN_DLC_BYTES_8:
                *f_Dlc_pe = FMKFDCAN_DLC_8;
                break;
            case FDCAN_DLC_BYTES_16:
                *f_Dlc_pe = FMKFDCAN_DLC_16;
                break;
            case FDCAN_DLC_BYTES_20:
                *f_Dlc_pe = FMKFDCAN_DLC_20;
                break;
            case FDCAN_DLC_BYTES_24:
                *f_Dlc_pe = FMKFDCAN_DLC_24;
                break;
            case FDCAN_DLC_BYTES_32:
                *f_Dlc_pe = FMKFDCAN_DLC_32;
                break;
            case FDCAN_DLC_BYTES_48:
                *f_Dlc_pe = FMKFDCAN_DLC_48;
                break;
            case FDCAN_DLC_BYTES_64:
                *f_Dlc_pe = FMKFDCAN_DLC_64;
                break;
            default:
                Ret_e = RC_ERROR_NOT_SUPPORTED;
                break;
        }
    }
    
    return Ret_e;
}

/*****************************
* s_FMKFDCAN_GetBspCallbackId
******************************/
static t_eReturnCode s_FMKFDCAN_GetBspCallbackId(t_eFMKFDCAN_BspCallbackList f_Callback_e, t_uint32 *f_bspCallback_u32)
{
    t_eReturnCode Ret_e = RC_OK;

    if(f_Callback_e >= FMKFDCAN_BSP_CB_NB)
    {
        Ret_e = RC_ERROR_PARAM_INVALID;
    }
    if(f_bspCallback_u32 == (t_uint32 *)NULL)
    {
        Ret_e = RC_ERROR_PTR_NULL;
    }
    if(Ret_e == RC_OK)
    {
        switch(f_Callback_e)
        {
            case FMKFDCAN_BSP_TX_CB_EVENT: 
                *f_bspCallback_u32 = FDCAN_IT_LIST_TX_FIFO_ERROR;
                break;
            case FMKFDCAN_BSP_TX_CB_BUFFER_COMPLETE:
                *f_bspCallback_u32 = FDCAN_IT_TX_COMPLETE;
                break;
            case FMKFDCAN_BSP_TX_CB_BUFFER_ABORT:
                *f_bspCallback_u32 = FDCAN_IT_TX_ABORT_COMPLETE;
                break;
            case FMKFDCAN_BSP_TX_CB_FIFO_EMPTY:
                *f_bspCallback_u32 = FDCAN_IT_TX_FIFO_EMPTY;
                break;
            case FMKFDCAN_BSP_RX_CB_FIFO_0:
                *f_bspCallback_u32 = FDCAN_IT_LIST_RX_FIFO0;
                break;
            case FMKFDCAN_BSP_RX_CB_FIFO_1:
                *f_bspCallback_u32 = FDCAN_IT_LIST_RX_FIFO1;
                break;
            case FMKFDCAN_BSP_CB_PROTOCOL_ERR:
                *f_bspCallback_u32 = FDCAN_IT_LIST_PROTOCOL_ERROR;
                break;
            case FMKFDCAN_BSP_CB_NB:
            default:
                Ret_e = RC_ERROR_NOT_SUPPORTED;
        }
    }
    
    return Ret_e;
}

/*****************************
* s_FMKFDCAN_GetBspRxFifoId
********************************/
static t_eReturnCode s_FMKFDCAN_GetBspRxFifoId(t_eFMKFDCAN_HwRxFifoList f_RxFifoId_e, t_uint32 *f_bspRxFifoId_u32)
{
    t_eReturnCode Ret_e = RC_OK;

    if(f_RxFifoId_e >= FMKFDCAN_HW_RX_FIFO_NB)
    {
        Ret_e = RC_ERROR_PARAM_INVALID;
    }
    if(f_bspRxFifoId_u32 == (t_uint32 *)NULL)
    {
        Ret_e = RC_ERROR_PTR_NULL;
    }
    if(Ret_e == RC_OK)
    {
        switch(f_RxFifoId_e)
        {
            case FMKFDCAN_HW_RX_FIFO_0: 
                *f_bspRxFifoId_u32 =FDCAN_RX_FIFO0;
                break;

            case FMKFDCAN_HW_RX_FIFO_1:
                *f_bspRxFifoId_u32 =FDCAN_RX_FIFO1;
                break;

            case FMKFDCAN_HW_RX_FIFO_NB:
            default:
                Ret_e = RC_ERROR_NOT_SUPPORTED;
        }
    }
    
    return Ret_e;
}
/*****************************
* s_FMKFDCAN_GetBspRxFifoId
********************************/
static t_eReturnCode s_FMKFDCAN_GetBspTxFifoId(t_eFMKFDCAN_HwTxFifoList f_TxFifoId_e, t_uint32 *f_bspTxFifoId_u32)
{
    t_eReturnCode Ret_e = RC_OK;

    if(f_TxFifoId_e >= FMKFDCAN_HW_TX_BUFFER_NB)
    {
        Ret_e = RC_ERROR_PARAM_INVALID;
    }
    if(f_bspTxFifoId_u32 == (t_uint32 *)NULL)
    {
        Ret_e = RC_ERROR_PTR_NULL;
    }
    if(Ret_e == RC_OK)
    {
        switch(f_TxFifoId_e)
        {
            case FMKFDCAN_HW_TX_BUFFER_1: 
                *f_bspTxFifoId_u32 =FDCAN_TX_BUFFER0;
                break;

            case FMKFDCAN_HW_TX_BUFFER_2:
                *f_bspTxFifoId_u32 =FDCAN_TX_BUFFER1;
                break;

            case FMKFDCAN_HW_TX_BUFFER_3:
                *f_bspTxFifoId_u32 =FDCAN_TX_BUFFER2;
                break;
            case FMKFDCAN_HW_TX_BUFFER_NB:
            default:
                Ret_e = RC_ERROR_NOT_SUPPORTED;
        }
    }
    
    return Ret_e;
}

/*****************************
* s_FMKFDCAN_GetBspFDFormat
******************************/
static t_eReturnCode s_FMKFDCAN_GetBspFDFormat(t_eFMKFDCAN_FrameFormat f_formatType_e, t_uint32 *f_BspFormatType_pu32)
{
    t_eReturnCode Ret_e = RC_OK;

    if(f_formatType_e >= FMKFDCAN_FRAME_FORMAT_NB)
    {
        Ret_e = RC_ERROR_PARAM_INVALID;
    }
    if(f_BspFormatType_pu32 == (t_uint32 *)NULL)
    {
        Ret_e = RC_ERROR_PTR_NULL;
    }
    if(Ret_e == RC_OK)
    {
        switch(f_formatType_e)
        {
            case FMKFDCAN_FRAME_FORMAT_CLASSIC:
                *f_BspFormatType_pu32 = FDCAN_CLASSIC_CAN;
                break;

            case FMKFDCAN_FRAME_FORMAT_FDCAN:
                *f_BspFormatType_pu32 = FDCAN_FD_CAN;
                break;

