mbarbeau0545/STM32_FMKCAN/Src/FMK_FDCAN.c
            case FMKFDCAN_FRAME_PURPOSE_NB:
            default:
                Ret_e = RC_ERROR_NOT_SUPPORTED;
        }
    }
    
    return Ret_e;
}
/*****************************
* s_FMKFDCAN_GetBspQueueType
******************************/
static t_eReturnCode s_FMKFDCAN_GetBspQueueType(t_eFMKFDCAN_HwTxQueueType f_queueType_e, t_uint32 *f_bspQueueType_pu32)
{
    t_eReturnCode Ret_e = RC_OK;

    if(f_queueType_e >= FMKFDCAN_HWQUEUE_TYPE_NB)
    {
        Ret_e = RC_ERROR_PARAM_INVALID;
    }
    if(f_bspQueueType_pu32 == (t_uint32 *)NULL)
    {
        Ret_e = RC_ERROR_PTR_NULL;
    }
    if(Ret_e == RC_OK)
    {
        switch(f_queueType_e)
        {
            case FMKFDCAN_HWQUEUE_TYPE_NORMAL:
                *f_bspQueueType_pu32 = FDCAN_TX_QUEUE_OPERATION;
                break;

            case FMKFDCAN_HWQUEUE_TYPE_FIFO:
                *f_bspQueueType_pu32 = FDCAN_TX_FIFO_OPERATION;
                break;
            
            case FMKFDCAN_HWQUEUE_TYPE_NB:
            default:
                Ret_e = RC_ERROR_NOT_SUPPORTED;
        }
    }
    
    return Ret_e;
}

/*****************************
* s_FMKFDCAN_GetBspQueueType
*****************************/
static t_eReturnCode s_FMKFDCAN_GetBspFifoOpeMode(t_eFMKFDCAN_FifoOpeMode f_fifoOpeMode , t_uint32 *f_bspfifoOpeMode_e)
{
    t_eReturnCode Ret_e = RC_OK;

    if(f_fifoOpeMode >= FMKFDCAN_FIFO_OPEMODE_NB)
    {
        Ret_e = RC_ERROR_PARAM_INVALID;
    }
    if(f_bspfifoOpeMode_e == (t_uint32 *)NULL)
    {
        Ret_e = RC_ERROR_PTR_NULL;
    }
    if(Ret_e == RC_OK)
    {
        switch(f_fifoOpeMode)
        {
            case FMKFDCAN_FIFO_OPEMODE_OVERWRITE:
                *f_bspfifoOpeMode_e = FDCAN_RX_FIFO_OVERWRITE;
                break;

            case FMKFDCAN_FIFO_OPEMODE_BLOCKING:
                *f_bspfifoOpeMode_e = FDCAN_RX_FIFO_BLOCKING;
                break;
            
            case FMKFDCAN_FIFO_OPEMODE_NB:
            default:
                Ret_e = RC_ERROR_NOT_SUPPORTED;
        }
    }
    
    return Ret_e;
}

static t_eReturnCode s_FMKFDCAN_GetClockKernelDivider(t_eFMKFDCAN_ClockKernelDiv f_ClkDiv_e, t_uint32 * bspClkDiv_pu32)
{
    t_eReturnCode Ret_e = RC_OK;

    if(f_ClkDiv_e >= FMKFDCAN_CLOCK_KERNEL_DIV_NB)
    {
        Ret_e = RC_ERROR_PARAM_INVALID;
    }
    if(bspClkDiv_pu32 == (t_uint32 *)NULL)
    {
        Ret_e = RC_ERROR_PTR_NULL;
    }
    if(Ret_e == RC_OK)
    {
        switch(f_ClkDiv_e)
        {
            case FMKFDCAN_CLOCK_KERNEL_DIV1:
                *bspClkDiv_pu32 = FDCAN_CLOCK_DIV1;
                break;
            case FMKFDCAN_CLOCK_KERNEL_DIV2:
                *bspClkDiv_pu32 = FDCAN_CLOCK_DIV2;
                break;
            case FMKFDCAN_CLOCK_KERNEL_DIV4:
                *bspClkDiv_pu32 = FDCAN_CLOCK_DIV4;
                break;
            case FMKFDCAN_CLOCK_KERNEL_DIV6:
                *bspClkDiv_pu32 = FDCAN_CLOCK_DIV6;
                break;
            case FMKFDCAN_CLOCK_KERNEL_DIV8:
                *bspClkDiv_pu32 = FDCAN_CLOCK_DIV8;
                break;
            case FMKFDCAN_CLOCK_KERNEL_DIV10:
                *bspClkDiv_pu32 = FDCAN_CLOCK_DIV10;
                break;
            case FMKFDCAN_CLOCK_KERNEL_DIV12:
                *bspClkDiv_pu32 = FDCAN_CLOCK_DIV12;
                break;
            case FMKFDCAN_CLOCK_KERNEL_DIV14:
                *bspClkDiv_pu32 = FDCAN_CLOCK_DIV14;
                break;
            case FMKFDCAN_CLOCK_KERNEL_DIV16:
                *bspClkDiv_pu32 = FDCAN_CLOCK_DIV16;
                break;
            case FMKFDCAN_CLOCK_KERNEL_DIV18:
                *bspClkDiv_pu32 = FDCAN_CLOCK_DIV18;
                break;
            case FMKFDCAN_CLOCK_KERNEL_DIV20:
                *bspClkDiv_pu32 = FDCAN_CLOCK_DIV20;
                break;
            case FMKFDCAN_CLOCK_KERNEL_DIV22:
                *bspClkDiv_pu32 = FDCAN_CLOCK_DIV22;
                break;
            case FMKFDCAN_CLOCK_KERNEL_DIV24:
                *bspClkDiv_pu32 = FDCAN_CLOCK_DIV24;
                break;
            case FMKFDCAN_CLOCK_KERNEL_DIV26:
                *bspClkDiv_pu32 = FDCAN_CLOCK_DIV26;
                break;
            case FMKFDCAN_CLOCK_KERNEL_DIV28:
                *bspClkDiv_pu32 = FDCAN_CLOCK_DIV28;
                break;
            case FMKFDCAN_CLOCK_KERNEL_DIV30:
                *bspClkDiv_pu32 = FDCAN_CLOCK_DIV30;
                break;
            case FMKFDCAN_CLOCK_KERNEL_DIV_NB:
            default:
                Ret_e = RC_ERROR_NOT_SUPPORTED;
                break;
        }

    }
    return Ret_e;
}

//********************************************************************************
//                      Hardware Callback Management
//********************************************************************************

/**********************************
* HAL_FDCAN_TxEventFifoCallback
**********************************/
void HAL_FDCAN_TxEventFifoCallback(FDCAN_HandleTypeDef *hfdcan, uint32_t TxEventFifoITs)
{
    s_FMKFDCAN_BspTxEventCb(hfdcan, TxEventFifoITs, FMKFDCAN_BSP_TX_CB_EVENT);
}
/**********************************
* HAL_FDCAN_TxFifoEmptyCallback
**********************************/
void HAL_FDCAN_TxFifoEmptyCallback(FDCAN_HandleTypeDef *hfdcan)
{                           // not take in charge
    s_FMKFDCAN_BspTxEventCb(hfdcan, 0xFF, FMKFDCAN_BSP_TX_CB_FIFO_EMPTY);
}
/**********************************
* HAL_FDCAN_TxBufferCompleteCallback
**********************************/
void HAL_FDCAN_TxBufferCompleteCallback(FDCAN_HandleTypeDef *hfdcan, uint32_t BufferIndexes)
{
    s_FMKFDCAN_BspTxEventCb(hfdcan, BufferIndexes, FMKFDCAN_BSP_TX_CB_BUFFER_COMPLETE);
}
/**********************************
* HAL_FDCAN_TxBufferAbortCallback
**********************************/
void HAL_FDCAN_TxBufferAbortCallback(FDCAN_HandleTypeDef *hfdcan, uint32_t BufferIndexes)
{
    s_FMKFDCAN_BspTxEventCb(hfdcan, BufferIndexes, FMKFDCAN_BSP_TX_CB_BUFFER_ABORT);
}

/**********************************
* HAL_FDCAN_RxFifo1Callback
**********************************/
void HAL_FDCAN_RxFifo1Callback(FDCAN_HandleTypeDef *hfdcan, uint32_t RxFifo1ITs)
{
    s_FMKFDCAN_BspRxEventCb(hfdcan, RxFifo1ITs, FMKFDCAN_BSP_RX_CB_FIFO_1);
}
/**********************************
* HAL_FDCAN_RxFifo0Callback
**********************************/
void HAL_FDCAN_RxFifo0Callback(FDCAN_HandleTypeDef *hfdcan, uint32_t RxFifo0ITs)
{
    s_FMKFDCAN_BspRxEventCb(hfdcan, RxFifo0ITs, FMKFDCAN_BSP_RX_CB_FIFO_0);
}
/**********************************
* HAL_FDCAN_RxFifo0Callback
**********************************/
void HAL_FDCAN_ErrorCallback(FDCAN_HandleTypeDef *hfdcan)
{
    s_FMKFDCAN_BspErrorEventCb(hfdcan, hfdcan->ErrorCode);
}
/**********************************
* HAL_FDCAN_RxFifo0Callback
**********************************/
void HAL_FDCAN_ErrorStatusCallback(FDCAN_HandleTypeDef *hfdcan, uint32_t ErrorStatusITs)
{
    s_FMKFDCAN_BspErrorEventCb(hfdcan, ErrorStatusITs);
}

#endif // APPSYS_MODULE_FMKCAN_ENABLE
//************************************************************************************
// End of File
//************************************************************************************

/**
 *
 *	@brief
 *	@note   
 *
 *
 *	@param[in] 
 *	@param[out]
 *	 
 *
 *
 */